wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_adc.h
/*
 *******************************************************************************
    @file     reg_adc.h
    @author   AE TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE ADC
              FIRMWARE LIBRARY.
 *******************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its
       contributors may be used to endorse or promote products derived from this
       software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES,INCLUDING, BUT NOT LIMITED TO,
    THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
    PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
    CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
    EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
    PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
    OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
    OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
    ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_ADC_H
#define __REG_ADC_H

/* Files includes ------------------------------------------------------------*/
#include <core_cm0.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

/**
  * @brief ADC Base Address Definition
  */
#define ADC1_BASE                       (APB2PERIPH_BASE + 0x2400)              /*!< Base Address: 0x40012400 */
#define ADC_VOLTAGE_REF_BASE            (0x1FFFF7E0U)                           /*!< Voltage Reference base address(Half Word) */
#define ADC_TEMPERATURE_BASE            (0x1FFFF7F6U)                           /*!< Temperature base address(Half Word) */
#define ADC_AVG_SLOPE_VALUE             (4.821)                                 /*!< Temperature Avg_Slope value */
/* T(C) = (Vsense - V25) / Avg_Slope + 25 */
/* V25: Vsense value for 25C */
/* T(C) = (Value * Vdda - offset * 3300) / (4096 * Avg_slope) + 25 */
/* offset = (M16(ADC_TEMPERATURE_BASE) */
/* Vsense: current output voltage of the temperature sensor */
/* Vsense = Value * Vdda /4096 (Value is the converted result data of ADC) */
/* Avg_Slope: Average Slope for curve between Temperature vs. Vsense (given in mV/C or uV/C) */
/* Refer to the Temperature Sensor section for the actual values of V25 and Avg_Slope. */
/* Vref Fomula  (VREFoffset/4096) * 3.3V = (Value/4096)* VDDA */
/* VDDA = (VREFoffset/Value) * 3.3 */

/**
  * @brief Analog-to-Digital Converter register
  */
typedef struct {
    __IO uint32_t ADDATA;                                                            /*!< ADC data register,                             offset: 0x00 */
    __IO uint32_t ADCFG;                                                             /*!< ADC configuration register,                    offset: 0x04 */
    __IO uint32_t ADCR;                                                              /*!< ADC control register,                          offset: 0x08 */
    __IO uint32_t ADCHS;                                                             /*!< ADC channel selection register,                offset: 0x0C */
    __IO uint32_t ADCMPR;                                                            /*!< ADC window compare register,                   offset: 0x10 */
    __IO uint32_t ADSTA;                                                             /*!< ADC status register,                           offset: 0x14 */
    union {
        __IO uint32_t ADDR[16];                                                      /*!< ADC data registers                             offset: 0x18~0x54 */
        struct {
            __IO uint32_t ADDR0;                                                     /*!< ADC data register 0,                           offset: 0x18 */
            __IO uint32_t ADDR1;                                                     /*!< ADC data register 1,                           offset: 0x1C */
            __IO uint32_t ADDR2;                                                     /*!< ADC data register 2,                           offset: 0x20 */
            __IO uint32_t ADDR3;                                                     /*!< ADC data register 3,                           offset: 0x24 */
            __IO uint32_t ADDR4;                                                     /*!< ADC data register 4,                           offset: 0x28 */
            __IO uint32_t ADDR5;                                                     /*!< ADC data register 5,                           offset: 0x2C */
            __IO uint32_t ADDR6;                                                     /*!< ADC data register 6,                           offset: 0x30 */
            __IO uint32_t ADDR7;                                                     /*!< ADC data register 7,                           offset: 0x34 */
            __IO uint32_t ADDR8;                                                     /*!< ADC data register 8,                           offset: 0x38 */
            __IO uint32_t ADDR9;                                                     /*!< ADC data register 9,                           offset: 0x3C */
            __IO uint32_t ADDR10;                                                    /*!< ADC data register 10,                          offset: 0x40 */
            __IO uint32_t ADDR11;                                                    /*!< ADC data register 11,                          offset: 0x44 */
            __IO uint32_t ADDR12;                                                    /*!< ADC data register 12,                          offset: 0x48 */
            __IO uint32_t ADDR13;                                                    /*!< ADC data register 13,                          offset: 0x4C */
            __IO uint32_t ADDR14;                                                    /*!< ADC data register 14,                          offset: 0x50 */
            __IO uint32_t ADDR15;                                                    /*!< ADC data register 15,                          offset: 0x54 */
        };
    };
    __IO uint32_t ADSTA_EXT;                                                         /*!< ADC Extended Status Register,                  offset: 0x58 */
    __IO uint32_t CHANY0;                                                            /*!< ADC any Chan Select Register 0,                offset: 0x5C */
    __IO uint32_t CHANY1;                                                            /*!< ADC any Chan Select Register 1,                offset: 0x60 */
    __IO uint32_t ANY_CFG;                                                           /*!< ADC any Chan config Register,                  offset: 0x64 */
    __IO uint32_t ANY_CR;                                                            /*!< ADC any Chan control Register,                 offset: 0x68 */
    __IO uint32_t RESERVED0x6C;                                                      /*!< Reserved register                              offset: 0x6C */
    __IO uint32_t SMPR1;                                                             /*!< Sampling configuration register 1              offset: 0x70 */
    __IO uint32_t SMPR2;                                                             /*!< Sampling configuration register 2              offset: 0x74 */
    __IO uint32_t RESERVED0x78;                                                      /*!< Reserved register                              offset: 0x78 */
    union {
        __IO uint32_t JOFR[4];                                                       /*!< Injection channel data compensation registers  offset: 0x7C~0x88 */
        struct {
            __IO uint32_t JOFR0;                                                     /*!< Injection channel data compensation register 0 offset: 0x7C */
            __IO uint32_t JOFR1;                                                     /*!< Injection channel data compensation register 1 offset: 0x80 */
            __IO uint32_t JOFR2;                                                     /*!< Injection channel data compensation register 2 offset: 0x84 */
            __IO uint32_t JOFR3;                                                     /*!< Injection channel data compensation register 3 offset: 0x88 */
        };
    };
    __IO uint32_t JSQR;                                                              /*!< Injection sequence register                    offset: 0x8C */
    __IO uint32_t JADDATA;                                                           /*!< Inject data register                           offset: 0x90 */
    __IO uint32_t RESERVED0x94[7];                                                   /*!< Reserved                                       offset: 0x94~0xAC */
    union {
        __IO uint32_t JDR[4];                                                        /*!< Injection channel data registers               offset: 0xB0~0xBC */
        struct {
            __IO uint32_t JDR0;                                                      /*!< Injection channel data register 0              offset: 0xB0 */
            __IO uint32_t JDR1;                                                      /*!< Injection channel data register 1              offset: 0xB4 */
            __IO uint32_t JDR2;                                                      /*!< Injection channel data register 2              offset: 0xB8 */
            __IO uint32_t JDR3;                                                      /*!< Injection channel data register 3              offset: 0xBC */
        };
    };
    __IO uint32_t RESERVED0xC0[12];                                                  /*!< Reserved                                       offset: 0xC0~0xEC */
    __IO uint32_t LDATA;                                                             /*!< Last Conversion Data registers                 offset: 0xF0 */
} ADC_TypeDef;


/**
  * @brief ADC type pointer Definition
  */
#define ADC1                            ((ADC_TypeDef*) ADC1_BASE)

/**
  * @brief ADC_ADDATA Register Bit Definition
  */
#define ADC_ADDATA_DATA_Pos             (0)
#define ADC_ADDATA_DATA                 (0xFFFFU << ADC_ADDATA_DATA_Pos)        /*!< ADC 12bit convert data */

#define ADC_ADDATA_CHANNELSEL_Pos       (16)
#define ADC_ADDATA_CHANNELSEL           (0x0FU << ADC_ADDATA_CHANNELSEL_Pos)    /*!< CHANNELSEL[19:16] (ADC current channel convert data) */
#define ADC_ADDATA_CHANNELSEL_0         (0x00U << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  0 */
#define ADC_ADDATA_CHANNELSEL_1         (0x01U << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  1 */
#define ADC_ADDATA_CHANNELSEL_2         (0x02U << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  2 */
#define ADC_ADDATA_CHANNELSEL_3         (0x03U << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  3 */
#define ADC_ADDATA_CHANNELSEL_4         (0x04U << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  4 */
#define ADC_ADDATA_CHANNELSEL_5         (0x05U << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  5 */
#define ADC_ADDATA_CHANNELSEL_6         (0x06U << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  6 */
#define ADC_ADDATA_CHANNELSEL_7         (0x07U << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  7 */
#define ADC_ADDATA_CHANNELSEL_8         (0x08U << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  8 */
#define ADC_ADDATA_CHANNELSEL_9         (0x09U << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  9 */
#define ADC_ADDATA_CHANNELSEL_10        (0x0AU << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  10 */
#define ADC_ADDATA_CHANNELSEL_11        (0x0BU << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  11 */
#define ADC_ADDATA_CHANNELSEL_12        (0x0CU << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  12 */
#define ADC_ADDATA_CHANNELSEL_13        (0x0DU << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  13 */
#define ADC_ADDATA_CHANNELSEL_14        (0x0EU << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  14 */
#define ADC_ADDATA_CHANNELSEL_15        (0x0FU << ADC_ADDATA_CHANNELSEL_Pos)    /*!< ADC Channel select  15 */

#define ADC_ADDATA_OVERRUN_Pos          (20)
#define ADC_ADDATA_OVERRUN              (0x01U << ADC_ADDATA_OVERRUN_Pos)       /*!< ADC data will be cover */
#define ADC_ADDATA_VALID_Pos            (21)
#define ADC_ADDATA_VALID                (0x01U << ADC_ADDATA_VALID_Pos)         /*!< ADC data[11:0] is valid */

/**
  * @brief ADC_ADCFG Register Bit Definition
  */
#define ADC_ADCFG_ADEN_Pos              (0)
#define ADC_ADCFG_ADEN                  (0x01U << ADC_ADCFG_ADEN_Pos)           /*!< Enable ADC convert */
#define ADC_ADCFG_ADWEN_Pos             (1)
#define ADC_ADCFG_ADWEN                 (0x01U << ADC_ADCFG_ADWEN_Pos)          /*!< Enable ADC window compare */

#define ADC_ADCFG_TSEN_Pos              (2)
#define ADC_ADCFG_TSEN                  (0x01U << ADC_ADCFG_TSEN_Pos)           /*!< Enable ADC temperature sensor */

#define ADC_ADCFG_VSEN_Pos              (3)
#define ADC_ADCFG_VSEN                  (0x01U << ADC_ADCFG_VSEN_Pos)           /*!< Enable ADC voltage reference */

#define ADC_ADCFG_ADCPREH_Pos           (4)
#define ADC_ADCFG_ADCPREL_Pos           (14)
#define ADC_ADCFG_ADCPRE                ((0x07U << ADC_ADCFG_ADCPREH_Pos) + (0x01U << ADC_ADCFG_ADCPREL_Pos))
#define ADC_ADCFG_ADCPRE_2              ((0x00U << ADC_ADCFG_ADCPREH_Pos) + (0x00U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 2 */
#define ADC_ADCFG_ADCPRE_4              ((0x01U << ADC_ADCFG_ADCPREH_Pos) + (0x00U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 4 */
#define ADC_ADCFG_ADCPRE_6              ((0x02U << ADC_ADCFG_ADCPREH_Pos) + (0x00U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 6 */
#define ADC_ADCFG_ADCPRE_8              ((0x03U << ADC_ADCFG_ADCPREH_Pos) + (0x00U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 8 */
#define ADC_ADCFG_ADCPRE_10             ((0x04U << ADC_ADCFG_ADCPREH_Pos) + (0x00U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 10 */
#define ADC_ADCFG_ADCPRE_12             ((0x05U << ADC_ADCFG_ADCPREH_Pos) + (0x00U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 12 */
#define ADC_ADCFG_ADCPRE_14             ((0x06U << ADC_ADCFG_ADCPREH_Pos) + (0x00U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 14 */
#define ADC_ADCFG_ADCPRE_16             ((0x07U << ADC_ADCFG_ADCPREH_Pos) + (0x00U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 16 */
#define ADC_ADCFG_ADCPRE_3              ((0x00U << ADC_ADCFG_ADCPREH_Pos) + (0x01U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 3 */
#define ADC_ADCFG_ADCPRE_5              ((0x01U << ADC_ADCFG_ADCPREH_Pos) + (0x01U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 5 */
#define ADC_ADCFG_ADCPRE_7              ((0x02U << ADC_ADCFG_ADCPREH_Pos) + (0x01U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 7 */
#define ADC_ADCFG_ADCPRE_9              ((0x03U << ADC_ADCFG_ADCPREH_Pos) + (0x01U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 9 */
#define ADC_ADCFG_ADCPRE_11             ((0x04U << ADC_ADCFG_ADCPREH_Pos) + (0x01U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 11 */
#define ADC_ADCFG_ADCPRE_13             ((0x05U << ADC_ADCFG_ADCPREH_Pos) + (0x01U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 13 */
#define ADC_ADCFG_ADCPRE_15             ((0x06U << ADC_ADCFG_ADCPREH_Pos) + (0x01U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 15 */
#define ADC_ADCFG_ADCPRE_17             ((0x07U << ADC_ADCFG_ADCPREH_Pos) + (0x01U << ADC_ADCFG_ADCPREL_Pos))    /*!< ADC preclk 17 */

