wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_adc.h
#define ADC_ADCFG_RSLTCTL_Pos           (7)
#define ADC_ADCFG_RSLTCTL               (0x07U << ADC_ADCFG_RSLTCTL_Pos)        /*!< ADC resolution select */
#define ADC_ADCFG_RSLTCTL_12            (0x00U << ADC_ADCFG_RSLTCTL_Pos)        /*!< ADC resolution select 12bit */
#define ADC_ADCFG_RSLTCTL_11            (0x01U << ADC_ADCFG_RSLTCTL_Pos)        /*!< ADC resolution select 11bit */
#define ADC_ADCFG_RSLTCTL_10            (0x02U << ADC_ADCFG_RSLTCTL_Pos)        /*!< ADC resolution select 10bit */
#define ADC_ADCFG_RSLTCTL_9             (0x03U << ADC_ADCFG_RSLTCTL_Pos)        /*!< ADC resolution select 9bit */
#define ADC_ADCFG_RSLTCTL_8             (0x04U << ADC_ADCFG_RSLTCTL_Pos)        /*!< ADC resolution select 8bit */
#define ADC_ADCFG_JAWDEN_Pos            (16)
#define ADC_ADCFG_JAWDEN                (0x01U << ADC_ADCFG_JAWDEN_Pos)         /*!< Inject ADC conversion window comparison enable */

/**
  * @brief ADC_CR Register Bit Definition
  */
#define ADC_ADCR_EOSIE_Pos              (0)
#define ADC_ADCR_EOSIE                  (0x01U << ADC_ADCR_EOSIE_Pos)           /*!< ADC interrupt enable */

#define ADC_ADCR_AWDIE_Pos              (1)
#define ADC_ADCR_AWDIE                  (0x01U << ADC_ADCR_AWDIE_Pos)           /*!< Interrupt Enable of Analog Watchdog */

#define ADC_ADCR_TRGEN_Pos              (2)
#define ADC_ADCR_TRGEN                  (0x01U << ADC_ADCR_TRGEN_Pos)           /*!< extranal trigger single start AD convert */
#define ADC_ADCR_DMAEN_Pos              (3)
#define ADC_ADCR_DMAEN                  (0x01U << ADC_ADCR_DMAEN_Pos)           /*!< ADC DMA enable */



#define ADC_ADCR_ADST_Pos               (8)
#define ADC_ADCR_ADST                   (0x01U << ADC_ADCR_ADST_Pos)            /*!< ADC start convert data */
#define ADC_ADCR_ADMD_Pos               (9)
#define ADC_ADCR_ADMD                   (0x03U << ADC_ADCR_ADMD_Pos)            /*!< ADC convert mode */
#define ADC_ADCR_ADMD_IMM               (0x00U << ADC_ADCR_ADMD_Pos)            /*!< ADC imm convert mode */
#define ADC_ADCR_ADMD_SCAN              (0x01U << ADC_ADCR_ADMD_Pos)            /*!< ADC scan convert mode */
#define ADC_ADCR_ADMD_CONTINUE          (0x02U << ADC_ADCR_ADMD_Pos)            /*!< ADC continue scan convert mode */
#define ADC_ADCR_ALIGN_Pos              (11)
#define ADC_ADCR_ALIGN                  (0x01U << ADC_ADCR_ALIGN_Pos)           /*!< ADC data align */
#define ADC_ADCR_LEFT                   (0x01U << ADC_ADCR_ALIGN_Pos)           /*!< ADC data left align */
#define ADC_ADCR_RIGHT                  (0x00U << ADC_ADCR_ALIGN_Pos)           /*!< ADC data right align */
#define ADC_ADCR_CMPCH_Pos              (12)
#define ADC_ADCR_CMPCH                  (0x0FU << ADC_ADCR_CMPCH_Pos)           /*!< CMPCH[15:12] ADC window compare channel0 convert data */
#define ADC_ADCR_CMPCH_0                (0x00U << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 0 Conversion Results */
#define ADC_ADCR_CMPCH_1                (0x01U << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 1 Conversion Results */
#define ADC_ADCR_CMPCH_2                (0x02U << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 2 Conversion Results */
#define ADC_ADCR_CMPCH_3                (0x03U << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 3 Conversion Results */
#define ADC_ADCR_CMPCH_4                (0x04U << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 4 Conversion Results */
#define ADC_ADCR_CMPCH_5                (0x05U << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 5 Conversion Results */
#define ADC_ADCR_CMPCH_6                (0x06U << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 6 Conversion Results */
#define ADC_ADCR_CMPCH_7                (0x07U << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 7 Conversion Results */
#define ADC_ADCR_CMPCH_8                (0x08U << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 8 Conversion Results */
#define ADC_ADCR_CMPCH_9                (0x09U << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 9 Conversion Results */
#define ADC_ADCR_CMPCH_10               (0x0AU << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 10 Conversion Results */
#define ADC_ADCR_CMPCH_11               (0x0BU << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 11 Conversion Results */
#define ADC_ADCR_CMPCH_12               (0x0CU << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 12 Conversion Results */
#define ADC_ADCR_CMPCH_13               (0x0DU << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 13 Conversion Results */
#define ADC_ADCR_CMPCH_14               (0x0EU << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare Channel 14 Conversion Results */
#define ADC_ADCR_CMPCH_ALL              (0x0FU << ADC_ADCR_CMPCH_Pos)           /*!< Select Compare ALL Channel Conversion Results */

#define ADC_ADCR_SCANDIR_Pos            (16)
#define ADC_ADCR_SCANDIR                (0x01U << ADC_ADCR_SCANDIR_Pos)         /*!< ADC scan direction */

#define ADC_ADCR_TRGSELH_Pos            (17)
#define ADC_ADCR_TRGSELL_Pos            (4)
#define ADC_ADCR_TRGSEL                 ((0x03U << ADC_ADCR_TRGSELH_Pos) + (0x07U << ADC_ADCR_TRGSELL_Pos))   /*!< TRGSEL[6:4][18:17] ADC external trigger source select */
#define ADC_ADCR_TRGSEL_T1_CC1          ((0x00U << ADC_ADCR_TRGSELH_Pos) + (0x00U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is T1_CC1 */
#define ADC_ADCR_TRGSEL_T1_CC2          ((0x00U << ADC_ADCR_TRGSELH_Pos) + (0x01U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is T1_CC2 */
#define ADC_ADCR_TRGSEL_T1_CC3          ((0x00U << ADC_ADCR_TRGSELH_Pos) + (0x02U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is T1_CC3 */
#define ADC_ADCR_TRGSEL_T2_CC2          ((0x00U << ADC_ADCR_TRGSELH_Pos) + (0x03U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is T2_CC2 */
#define ADC_ADCR_TRGSEL_T3_TRIG         ((0x00U << ADC_ADCR_TRGSELH_Pos) + (0x04U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is T3_TRIG */
#define ADC_ADCR_TRGSEL_T1_CC4_CC5      ((0x00U << ADC_ADCR_TRGSELH_Pos) + (0x05U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is T1_CC4_CC5 */
#define ADC_ADCR_TRGSEL_T3_CC1          ((0x00U << ADC_ADCR_TRGSELH_Pos) + (0x06U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is T3_CC1 */
#define ADC_ADCR_TRGSEL_EXTI_11         ((0x00U << ADC_ADCR_TRGSELH_Pos) + (0x07U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is EXTI_11 */
#define ADC_ADCR_TRGSEL_T1_TRIG         ((0x01U << ADC_ADCR_TRGSELH_Pos) + (0x00U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is T1_TRIG */
#define ADC_ADCR_TRGSEL_EXTI_4          ((0x01U << ADC_ADCR_TRGSELH_Pos) + (0x01U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is EXTI_4 */
#define ADC_ADCR_TRGSEL_EXTI_5          ((0x01U << ADC_ADCR_TRGSELH_Pos) + (0x02U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is EXTI_5 */
#define ADC_ADCR_TRGSEL_T2_CC1          ((0x01U << ADC_ADCR_TRGSELH_Pos) + (0x03U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is T2_CC1 */
#define ADC_ADCR_TRGSEL_T3_CC4          ((0x01U << ADC_ADCR_TRGSELH_Pos) + (0x04U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is T3_CC4 */
#define ADC_ADCR_TRGSEL_T2_TRIG         ((0x01U << ADC_ADCR_TRGSELH_Pos) + (0x05U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is T2_TRIG */
#define ADC_ADCR_TRGSEL_EXTI_15         ((0x01U << ADC_ADCR_TRGSELH_Pos) + (0x07U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is EXTI_15 */
#define ADC_ADCR_TRGSEL_T1_CC4          ((0x02U << ADC_ADCR_TRGSELH_Pos) + (0x00U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is T1_CC4 */
#define ADC_ADCR_TRGSEL_T1_CC5          ((0x02U << ADC_ADCR_TRGSELH_Pos) + (0x01U << ADC_ADCR_TRGSELL_Pos))   /*!< The external trigger source of the ADC is T1_CC5 */

#define ADC_ADCR_TRGSHIFT_Pos           (19)
#define ADC_ADCR_TRGSHIFT               (0x07U << ADC_ADCR_TRGSHIFT_Pos)        /*!< External trigger shift sample */
#define ADC_ADCR_TRGSHIFT_0             (0x00U << ADC_ADCR_TRGSHIFT_Pos)        /*!< No shift */
#define ADC_ADCR_TRGSHIFT_4             (0x01U << ADC_ADCR_TRGSHIFT_Pos)        /*!< Shift 4 period */
#define ADC_ADCR_TRGSHIFT_16            (0x02U << ADC_ADCR_TRGSHIFT_Pos)        /*!< Shift 16 period */
#define ADC_ADCR_TRGSHIFT_32            (0x03U << ADC_ADCR_TRGSHIFT_Pos)        /*!< Shift 32 period */
#define ADC_ADCR_TRGSHIFT_64            (0x04U << ADC_ADCR_TRGSHIFT_Pos)        /*!< Shift 64 period */
#define ADC_ADCR_TRGSHIFT_128           (0x05U << ADC_ADCR_TRGSHIFT_Pos)        /*!< Shift 128 period */
#define ADC_ADCR_TRGSHIFT_256           (0x06U << ADC_ADCR_TRGSHIFT_Pos)        /*!< Shift 256 period */
#define ADC_ADCR_TRGSHIFT_512           (0x07U << ADC_ADCR_TRGSHIFT_Pos)        /*!< Shift 512 period */
#define ADC_ADCR_TRG_EDGE_Pos           (24)
#define ADC_ADCR_TRG_EDGE               (0x03U << ADC_ADCR_TRG_EDGE_Pos)        /*!< ADC trig edge config */
#define ADC_ADCR_TRG_EDGE_DUAL          (0x00U << ADC_ADCR_TRG_EDGE_Pos)        /*!< ADC dual edge trig mode */
#define ADC_ADCR_TRG_EDGE_DOWN          (0x01U << ADC_ADCR_TRG_EDGE_Pos)        /*!< ADC down edge trig mode */
#define ADC_ADCR_TRG_EDGE_UP            (0x02U << ADC_ADCR_TRG_EDGE_Pos)        /*!< ADC up   edge trig mode */
#define ADC_ADCR_TRG_EDGE_MASK          (0x03U << ADC_ADCR_TRG_EDGE_Pos)        /*!< ADC mask edge trig mode */

#define ADC_ADCR_EOSMPIE_Pos            (26)
#define ADC_ADCR_EOSMPIE                (0X01U << ADC_ADCR_EOSMPIE_Pos)         /*!< ADC end sampling flag interrupt enable */
#define ADC_ADCR_EOCIE_Pos              (27)
#define ADC_ADCR_EOCIE                  (0X01U << ADC_ADCR_EOCIE_Pos)           /*!< ADC end of conversion interrupt enable */

/**
  * @brief ADC_ADCHS Register Bit Definition
  */
#define ADC_ADCHS_CHEN0_Pos             (0)
#define ADC_ADCHS_CHEN0                 (0x01U << ADC_ADCHS_CHEN0_Pos)          /*!< Enable ADC channel 0 */
#define ADC_ADCHS_CHEN1_Pos             (1)
#define ADC_ADCHS_CHEN1                 (0x01U << ADC_ADCHS_CHEN1_Pos)          /*!< Enable ADC channel 1 */
#define ADC_ADCHS_CHEN2_Pos             (2)
#define ADC_ADCHS_CHEN2                 (0x01U << ADC_ADCHS_CHEN2_Pos)          /*!< Enable ADC channel 2 */
#define ADC_ADCHS_CHEN3_Pos             (3)
#define ADC_ADCHS_CHEN3                 (0x01U << ADC_ADCHS_CHEN3_Pos)          /*!< Enable ADC channel 3 */
#define ADC_ADCHS_CHEN4_Pos             (4)
#define ADC_ADCHS_CHEN4                 (0x01U << ADC_ADCHS_CHEN4_Pos)          /*!< Enable ADC channel 4 */
#define ADC_ADCHS_CHEN5_Pos             (5)
#define ADC_ADCHS_CHEN5                 (0x01U << ADC_ADCHS_CHEN5_Pos)          /*!< Enable ADC channel 5 */
#define ADC_ADCHS_CHEN6_Pos             (6)
#define ADC_ADCHS_CHEN6                 (0x01U << ADC_ADCHS_CHEN6_Pos)          /*!< Enable ADC channel 6 */
#define ADC_ADCHS_CHEN7_Pos             (7)
#define ADC_ADCHS_CHEN7                 (0x01U << ADC_ADCHS_CHEN7_Pos)          /*!< Enable ADC channel 7 */
#define ADC_ADCHS_CHEN8_Pos             (8)
#define ADC_ADCHS_CHEN8                 (0x01U << ADC_ADCHS_CHEN8_Pos)          /*!< Enable ADC channel 8 */
#define ADC_ADCHS_CHEN9_Pos             (9)
#define ADC_ADCHS_CHEN9                 (0x01U << ADC_ADCHS_CHEN9_Pos)          /*!< Enable ADC channel 9 */
#define ADC_ADCHS_CHEN10_Pos            (10)
#define ADC_ADCHS_CHEN10                (0x01U << ADC_ADCHS_CHEN10_Pos)         /*!< Enable ADC channel 10 */
#define ADC_ADCHS_CHEN11_Pos            (11)
#define ADC_ADCHS_CHEN11                (0x01U << ADC_ADCHS_CHEN11_Pos)         /*!< Enable ADC channel 11 */
#define ADC_ADCHS_CHEN12_Pos            (12)
#define ADC_ADCHS_CHEN12                (0x01U << ADC_ADCHS_CHEN12_Pos)         /*!< Enable ADC channel 12 */
#define ADC_ADCHS_CHEN13_Pos            (13)
#define ADC_ADCHS_CHEN13                (0x01U << ADC_ADCHS_CHEN13_Pos)         /*!< Enable ADC channel 13 */
#define ADC_ADCHS_CHEN14_Pos            (14)
#define ADC_ADCHS_CHEN14                (0x01U << ADC_ADCHS_CHEN14_Pos)         /*!< Enable ADC channel 14 */
#define ADC_ADCHS_CHEN15_Pos            (15)
#define ADC_ADCHS_CHEN15                (0x01U << ADC_ADCHS_CHEN15_Pos)         /*!< Enable ADC channel 15 */

#define ADC_ADCHS_CHT_Pos                ADC_ADCHS_CHEN14_Pos
#define ADC_ADCHS_CHT                    ADC_ADCHS_CHEN14                           /*!< Enable Temperature Sensor */
#define ADC_ADCHS_CHV_Pos                ADC_ADCHS_CHEN15_Pos
#define ADC_ADCHS_CHV                    ADC_ADCHS_CHEN15                           /*!< Enable Voltage Sensor */

/**
  * @brief ADC_ADCMPR Register Bit Definition
  */
#define ADC_ADCMPR_CMPLDATA_Pos         (0)
#define ADC_ADCMPR_CMPLDATA             (0x0FFFU << ADC_ADCMPR_CMPLDATA_Pos)    /*!< ADC 12bit window compare DOWN LEVEL DATA */
#define ADC_ADCMPR_CMPHDATA_Pos         (16)
#define ADC_ADCMPR_CMPHDATA             (0x0FFFU << ADC_ADCMPR_CMPHDATA_Pos)    /*!< ADC 12bit window compare UP LEVEL DATA */

/**
  * @brief ADC_ADSTA Register Bit Definition
  */
#define ADC_ADSTA_EOSIF_Pos             (0)
#define ADC_ADSTA_EOSIF                 (0x01U << ADC_ADSTA_EOSIF_Pos)          /*!< ADC convert complete flag */

#define ADC_ADSTA_AWDIF_Pos             (1)
#define ADC_ADSTA_AWDIF                 (0x01U << ADC_ADSTA_AWDIF_Pos)          /*!< ADC compare flag */

