wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_adc.h
#define ADC_ADSTA_BUSY_Pos              (2)
#define ADC_ADSTA_BUSY                  (0x01U << ADC_ADSTA_BUSY_Pos)           /*!< ADC busy flag */
#define ADC_ADSTA_CHANNEL_Pos           (4)
#define ADC_ADSTA_CHANNEL               (0x0FU << ADC_ADSTA_CHANNEL_Pos)        /*!< CHANNEL[7:4] ADC current channel */
#define ADC_ADSTA_CHANNEL_0             (0x00U << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 0 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_1             (0x01U << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 1 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_2             (0x02U << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 2 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_3             (0x03U << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 3 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_4             (0x04U << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 4 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_5             (0x05U << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 5 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_6             (0x06U << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 6 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_7             (0x07U << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 7 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_8             (0x08U << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 8 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_9             (0x09U << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 9 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_10            (0x0AU << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 10 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_11            (0x0BU << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 11 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_12            (0x0CU << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 12 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_13            (0x0DU << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 13 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_14            (0x0EU << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 14 is the current conversion channel */
#define ADC_ADSTA_CHANNEL_15            (0x0FU << ADC_ADSTA_CHANNEL_Pos)        /*!< Channel 15 is the current conversion channel */
#define ADC_ADSTA_CHT                   ADC_ADSTA_CCHEN_14
#define ADC_ADSTA_CHV                   ADC_ADSTA_CCHEN_15

#define ADC_ADSTA_VALID_Pos             (8)
#define ADC_ADSTA_VALID                 (0x0FFFU << ADC_ADSTA_VALID_Pos)        /*!< VALID[19:8] ADC channel 0..11 valid flag */
#define ADC_ADSTA_OVERRUN_Pos           (20)
#define ADC_ADSTA_OVERRUN               (0x0FFFU << ADC_ADSTA_OVERRUN_Pos)      /*!< OVERRUN[31:20] ADC channel 0..11 data covered flag */

/**
  * @brief ADC_ADDRn Register Bit Definition
  */
#define ADC_ADDR_DATA_Pos               (0)
#define ADC_ADDR_DATA                   (0xFFFFU << ADC_ADDR_DATA_Pos)          /*!< ADC channel convert data */
#define ADC_ADDR_OVERRUN_Pos            (20)
#define ADC_ADDR_OVERRUN                (0x01U << ADC_ADDR_OVERRUN_Pos)         /*!< ADC data covered flag */
#define ADC_ADDR_VALID_Pos              (21)
#define ADC_ADDR_VALID                  (0x01U << ADC_ADDR_VALID_Pos)           /*!< ADC data valid flag */

/**
  * @brief ADC_ADDSTA_EXT Register Bit Definition
  */
#define ADC_ADDSTA_EXT_VALID_Pos        (0)
#define ADC_ADDSTA_EXT_VALID            (0x0FU << ADC_ADDSTA_EXT_VALID_Pos)     /*!< VALID[3:0] ADC channel 12,14..15 valid flag */
#define ADC_ADDSTA_EXT_VALID_CH12       (0x01U << ADC_ADDSTA_EXT_VALID_Pos)     /*!< channel 12 */
#define ADC_ADDSTA_EXT_VALID_CH13       (0x02U << ADC_ADDSTA_EXT_VALID_Pos)     /*!< channel 13 */
#define ADC_ADDSTA_EXT_VALID_CH14       (0x04U << ADC_ADDSTA_EXT_VALID_Pos)     /*!< channel 14  T_SENSOR */
#define ADC_ADDSTA_EXT_VALID_CH15       (0x08U << ADC_ADDSTA_EXT_VALID_Pos)     /*!< channel 15  V_SENSOR */

#define ADC_ADDSTA_EXT_OVERRUN_Pos      (4)
#define ADC_ADDSTA_EXT_OVERRUN          (0x0FU << ADC_ADDSTA_EXT_OVERRUN_Pos)   /*!< OVERRUN[7:4] ADC channel 12,14..15 data covered flag */
#define ADC_ADDSTA_EXT_OVERRUN_CH12     (0x01U << ADC_ADDSTA_EXT_OVERRUN_Pos)   /*!< channel 12 */
#define ADC_ADDSTA_EXT_OVERRUN_CH13     (0x02U << ADC_ADDSTA_EXT_OVERRUN_Pos)   /*!< channel 13 */
#define ADC_ADDSTA_EXT_OVERRUN_CH14     (0x04U << ADC_ADDSTA_EXT_OVERRUN_Pos)   /*!< channel 14  T_SENSOR */
#define ADC_ADDSTA_EXT_OVERRUN_CH15     (0x08U << ADC_ADDSTA_EXT_OVERRUN_Pos)   /*!< channel 15  V_SENSOR */

#define ADC_ADDSTA_EXT_EOSMPIF_Pos      (16)
#define ADC_ADDSTA_EXT_EOSMPIF          (0x01U << ADC_ADDSTA_EXT_EOSMPIF_Pos)   /*!< End of sampling interrupt flag */
#define ADC_ADDSTA_EXT_EOCIF_Pos        (17)
#define ADC_ADDSTA_EXT_EOCIF            (0x01U << ADC_ADDSTA_EXT_EOCIF_Pos)     /*!< End of conversion interrupt flag */
#define ADC_ADDSTA_EXT_JEOSMPIF_Pos     (18)
#define ADC_ADDSTA_EXT_JEOSMPIF         (0x01U << ADC_ADDSTA_EXT_JEOSMPIF_Pos)  /*!< Injected channel end of sampling interrupt flag */
#define ADC_ADDSTA_EXT_JEOCIF_Pos       (19)
#define ADC_ADDSTA_EXT_JEOCIF           (0x01U << ADC_ADDSTA_EXT_JEOCIF_Pos)    /*!< Injected channel end of conversion interrupt flag */
#define ADC_ADDSTA_EXT_JEOSIF_Pos       (20)
#define ADC_ADDSTA_EXT_JEOSIF           (0x01U << ADC_ADDSTA_EXT_JEOSIF_Pos)    /*!< Injected channel end of sequential conversion interrupt flag */
#define ADC_ADDSTA_EXT_JBUSY_Pos        (21)
#define ADC_ADDSTA_EXT_JBUSY            (0x01U << ADC_ADDSTA_EXT_JBUSY_Pos)     /*!< Injection mode busy/idle */

/**
  * @brief ADC_CHANY0 select Register Bit Definition
  */
#define ADC_CHANY0_SEL0_Pos             (0)                                     /*!< CHANY_SEL0 (Bit 0) */
#define ADC_CHANY0_SEL0                 (0x0FU << ADC_CHANY0_SEL0_Pos)          /*!< CHANY_SEL0 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SEL1_Pos             (4)                                     /*!< CHANY_SEL1 (Bit 4) */
#define ADC_CHANY0_SEL1                 (0x0FU << ADC_CHANY0_SEL1_Pos)          /*!< CHANY_SEL1 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SEL2_Pos             (8)                                     /*!< CHANY_SEL2 (Bit 8) */
#define ADC_CHANY0_SEL2                 (0x0FU << ADC_CHANY0_SEL2_Pos)          /*!< CHANY_SEL2 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SEL3_Pos             (12)                                    /*!< CHANY_SEL3 (Bit 12) */
#define ADC_CHANY0_SEL3                 (0x0FU << ADC_CHANY0_SEL3_Pos)          /*!< CHANY_SEL3 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SEL4_Pos             (16)                                    /*!< CHANY_SEL4 (Bit 16) */
#define ADC_CHANY0_SEL4                 (0x0FU << ADC_CHANY0_SEL4_Pos)          /*!< CHANY_SEL4 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SEL5_Pos             (20)                                    /*!< CHANY_SEL5 (Bit 20) */
#define ADC_CHANY0_SEL5                 (0x0FU << ADC_CHANY0_SEL5_Pos)          /*!< CHANY_SEL5 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SEL6_Pos             (24)                                    /*!< CHANY_SEL6 (Bit 24) */
#define ADC_CHANY0_SEL6                 (0x0FU << ADC_CHANY0_SEL6_Pos)          /*!< CHANY_SEL6 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SEL7_Pos             (28)                                    /*!< CHANY_SEL7 (Bit 28) */
#define ADC_CHANY0_SEL7                 (0x0FU << ADC_CHANY0_SEL7_Pos)          /*!< CHANY_SEL7 (Bitfield-Mask: 0x0f) */

/**
  * @brief ADC_CHANY1 select Register Bit Definition
  */
#define ADC_CHANY1_SEL8_Pos             (0)                                     /*!< CHANY_SEL8 (Bit 0) */
#define ADC_CHANY1_SEL8                 (0x0FU << ADC_CHANY1_SEL8_Pos)          /*!< CHANY_SEL8 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SEL9_Pos             (4)                                     /*!< CHANY_SEL9 (Bit 4) */
#define ADC_CHANY1_SEL9                 (0x0FU << ADC_CHANY1_SEL9_Pos)          /*!< CHANY_SEL9 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SEL10_Pos            (8)                                     /*!< CHANY_SEL10 (Bit 8) */
#define ADC_CHANY1_SEL10                (0x0FU << ADC_CHANY1_SEL10_Pos)         /*!< CHANY_SEL10 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SEL11_Pos            (12)                                    /*!< CHANY_SEL11 (Bit 12) */
#define ADC_CHANY1_SEL11                (0x0FU << ADC_CHANY1_SEL11_Pos)         /*!< CHANY_SEL11 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SEL12_Pos            (16)                                    /*!< CHANY_SEL12 (Bit 16) */
#define ADC_CHANY1_SEL12                (0x0FU << ADC_CHANY1_SEL12_Pos)         /*!< CHANY_SEL12 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SEL13_Pos            (20)                                    /*!< CHANY_SEL13 (Bit 20) */
#define ADC_CHANY1_SEL13                (0x0FU << ADC_CHANY1_SEL13_Pos)         /*!< CHANY_SEL13 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SEL14_Pos            (24)                                    /*!< CHANY_SEL14 (Bit 24) */
#define ADC_CHANY1_SEL14                (0x0FU << ADC_CHANY1_SEL14_Pos)         /*!< CHANY_SEL14 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SEL15_Pos            (28)                                    /*!< CHANY_SEL15 (Bit 28) */
#define ADC_CHANY1_SEL15                (0x0FU << ADC_CHANY1_SEL15_Pos)         /*!< CHANY_SEL15 (Bitfield-Mask: 0x0f) */


/**
  * @brief ADC_ANY_CFG config number Register Bit Definition
  */
#define ADC_ANY_CFG_CHANY_NUM_Pos       (0)                                     /*!< CHANY_CFG_NUM Pos */
#define ADC_ANY_CFG_CHANY_NUM           (0x0FU << ADC_ANY_CFG_CHANY_NUM_Pos)    /*!< CHANY_CFG_NUM (Bitfield-Mask: 0x0f) */

/**
  * @brief ADC_ANY_CR mode enable Register Bit Definition
  */
#define ADC_ANY_CR_CHANY_MDEN_Pos       (0)                                     /*!< CHANY_MDEN (Bit 0) */
#define ADC_ANY_CR_CHANY_MDEN           (0x01U << ADC_ANY_CR_CHANY_MDEN_Pos)    /*!< CHANY_MDEN (Bitfield-Mask: 0x01) */
#define ADC_ANY_CR_JCEN_Pos             (1)
#define ADC_ANY_CR_JCEN                 (0x01U << ADC_ANY_CR_JCEN_Pos)          /*!< Injected channel enable */
#define ADC_ANY_CR_JEOSMPIE_Pos         (2)
#define ADC_ANY_CR_JEOSMPIE             (0x01U << ADC_ANY_CR_JEOSMPIE_Pos)      /*!< Interrupt enable the end of sequence conversion for injected channel */
#define ADC_ANY_CR_JEOCIE_Pos           (3)
#define ADC_ANY_CR_JEOCIE               (0x01U << ADC_ANY_CR_JEOCIE_Pos)        /*!< Interrupt enable the end of conversion for injected channel */
#define ADC_ANY_CR_JEOSIE_Pos           (4)
#define ADC_ANY_CR_JEOSIE               (0x01U << ADC_ANY_CR_JEOSIE_Pos)        /*!< Interrupt enable the end of sequence conversion for injected channel */
#define ADC_ANY_CR_JAUTO_Pos            (5)
#define ADC_ANY_CR_JAUTO                (0x01U << ADC_ANY_CR_JAUTO_Pos)         /*!<Automatic Injected group conversion */
#define ADC_ANY_CR_JADST_Pos            (6)
#define ADC_ANY_CR_JADST                (0x01U << ADC_ANY_CR_JADST_Pos)         /*!< Start conversion of injected channels */
#define ADC_ANY_CR_JTRGEN_Pos           (7)
#define ADC_ANY_CR_JTRGEN               (0x01U << ADC_ANY_CR_JTRGEN_Pos)        /*!< External trigger conversion mode for injected channels */

#define ADC_ANY_CR_JTRGSEL_Pos          (8)
#define ADC_ANY_CR_JTRGSEL              (0x1FU << ADC_ANY_CR_JTRGSEL_Pos)       /*!< External event select for injected group */
#define ADC_ANY_CR_JTRGSEL_TIM1_CC1     (0x00U << ADC_ANY_CR_JTRGSEL_Pos)       /*!< TIM1  CC1 */
#define ADC_ANY_CR_JTRGSEL_TIM1_CC2     (0x01U << ADC_ANY_CR_JTRGSEL_Pos)       /*!< TIM1  CC2 */
#define ADC_ANY_CR_JTRGSEL_TIM1_CC3     (0x02U << ADC_ANY_CR_JTRGSEL_Pos)       /*!< TIM1  CC3 */
#define ADC_ANY_CR_JTRGSEL_TIM2_CC2     (0x03U << ADC_ANY_CR_JTRGSEL_Pos)       /*!< TIM2  CC2 */
#define ADC_ANY_CR_JTRGSEL_TIM3_TRGO    (0x04U << ADC_ANY_CR_JTRGSEL_Pos)       /*!< TIM3  TRGO */
#define ADC_ANY_CR_JTRGSEL_TIM1_CC4_CC5 (0x05U << ADC_ANY_CR_JTRGSEL_Pos)       /*!< TIM1  CC4 CC5 */
#define ADC_ANY_CR_JTRGSEL_TIM3_CC1     (0x06U << ADC_ANY_CR_JTRGSEL_Pos)       /*!< TIM3  CC1 */
#define ADC_ANY_CR_JTRGSEL_EXTI11       (0x07U << ADC_ANY_CR_JTRGSEL_Pos)       /*!< EXTI11 */
#define ADC_ANY_CR_JTRGSEL_TIM1_TRGO    (0x08U << ADC_ANY_CR_JTRGSEL_Pos)       /*!< TIM1  TRGO */
#define ADC_ANY_CR_JTRGSEL_EXTI4        (0x09U << ADC_ANY_CR_JTRGSEL_Pos)       /*!< EXTI 4 */
#define ADC_ANY_CR_JTRGSEL_EXTI5        (0x0AU << ADC_ANY_CR_JTRGSEL_Pos)       /*!< EXTI 5 */
#define ADC_ANY_CR_JTRGSEL_TIM2_CC1     (0x0BU << ADC_ANY_CR_JTRGSEL_Pos)       /*!< TIM2  CC1 */
#define ADC_ANY_CR_JTRGSEL_TIM3_CC4     (0x0CU << ADC_ANY_CR_JTRGSEL_Pos)       /*!< TIM3  CC4 */
#define ADC_ANY_CR_JTRGSEL_TIM2_TRGO    (0x0DU << ADC_ANY_CR_JTRGSEL_Pos)       /*!< TIM2 TRGO */
#define ADC_ANY_CR_JTRGSEL_EXTI15       (0x0FU << ADC_ANY_CR_JTRGSEL_Pos)       /*!< EXTI15 */
#define ADC_ANY_CR_JTRGSEL_TIM1_CC4     (0x10U << ADC_ANY_CR_JTRGSEL_Pos)       /*!< TIM1_CC4 */
#define ADC_ANY_CR_JTRGSEL_TIM1_CC5     (0x11U << ADC_ANY_CR_JTRGSEL_Pos)       /*!< TIM1_CC5 */

#define ADC_ANY_CR_JTRGSHIFT_Pos        (13)
#define ADC_ANY_CR_JTRGSHIFT            (0x07U << ADC_ANY_CR_JTRGSHIFT_Pos)     /*!< select the sample time of corresponding channel */
#define ADC_ANY_CR_JTRGSHIFT_0          (0x00U << ADC_ANY_CR_JTRGSHIFT_Pos)     /*!< 0   cycle */
#define ADC_ANY_CR_JTRGSHIFT_4          (0x01U << ADC_ANY_CR_JTRGSHIFT_Pos)     /*!< 4   cycle */
#define ADC_ANY_CR_JTRGSHIFT_16         (0x02U << ADC_ANY_CR_JTRGSHIFT_Pos)     /*!< 16  cycle */
#define ADC_ANY_CR_JTRGSHIFT_32         (0x03U << ADC_ANY_CR_JTRGSHIFT_Pos)     /*!< 32  cycle */
#define ADC_ANY_CR_JTRGSHIFT_64         (0x04U << ADC_ANY_CR_JTRGSHIFT_Pos)     /*!< 64  cycle */
#define ADC_ANY_CR_JTRGSHIFT_128        (0x05U << ADC_ANY_CR_JTRGSHIFT_Pos)     /*!< 128 cycle */
#define ADC_ANY_CR_JTRGSHIFT_256        (0x06U << ADC_ANY_CR_JTRGSHIFT_Pos)     /*!< 256 cycle */
#define ADC_ANY_CR_JTRGSHIFT_512        (0x07U << ADC_ANY_CR_JTRGSHIFT_Pos)     /*!< 512 cycle */

#define ADC_ANY_CR_JTRGEDGE_Pos         (16)
#define ADC_ANY_CR_JTRGEDGE             (0x03U << ADC_ANY_CR_JTRGEDGE_Pos)      /*!< Injection mode triggers edge selection */
#define ADC_ANY_CR_JTRGEDGE_R_F         (0x00U << ADC_ANY_CR_JTRGEDGE_Pos)      /*!< Triggered along both rising and falling edges */
#define ADC_ANY_CR_JTRGEDGE_F           (0x01U << ADC_ANY_CR_JTRGEDGE_Pos)      /*!< Drop edge trigger */
#define ADC_ANY_CR_JTRGEDGE_R           (0x02U << ADC_ANY_CR_JTRGEDGE_Pos)      /*!< Rising edge trigger */
#define ADC_ANY_CR_JTRGEDGE_S           (0x03U << ADC_ANY_CR_JTRGEDGE_Pos)      /*!< Shield trigger */

/**
  * @brief ADC_SMPR1 mode enable Register Bit Definition
  */

#define ADC_SMPR_SAMP_Pos               (0)                                     /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR_SAMP                   (0x0FU << ADC_SMPR_SAMP_Pos)            /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR_SAMP_SEL_0             (0x00U << ADC_SMPR_SAMP_Pos)            /*!< 2.5    cycle */
#define ADC_SMPR_SAMP_SEL_1             (0x01U << ADC_SMPR_SAMP_Pos)            /*!< 8.5    cycle */
#define ADC_SMPR_SAMP_SEL_2             (0x02U << ADC_SMPR_SAMP_Pos)            /*!< 14.5   cycle */
#define ADC_SMPR_SAMP_SEL_3             (0x03U << ADC_SMPR_SAMP_Pos)            /*!< 29.5   cycle */
#define ADC_SMPR_SAMP_SEL_4             (0x04U << ADC_SMPR_SAMP_Pos)            /*!< 42.5   cycle */
#define ADC_SMPR_SAMP_SEL_5             (0x05U << ADC_SMPR_SAMP_Pos)            /*!< 56.5   cycle */
#define ADC_SMPR_SAMP_SEL_6             (0x06U << ADC_SMPR_SAMP_Pos)            /*!< 72.5   cycle */
#define ADC_SMPR_SAMP_SEL_7             (0x07U << ADC_SMPR_SAMP_Pos)            /*!< 240.5  cycle */
#define ADC_SMPR_SAMP_SEL_8             (0x08U << ADC_SMPR_SAMP_Pos)            /*!< 3.5    cycle */
#define ADC_SMPR_SAMP_SEL_9             (0x09U << ADC_SMPR_SAMP_Pos)            /*!< 4.5    cycle */
#define ADC_SMPR_SAMP_SEL_10            (0x0AU << ADC_SMPR_SAMP_Pos)            /*!< 5.5    cycle */
#define ADC_SMPR_SAMP_SEL_11            (0x0BU << ADC_SMPR_SAMP_Pos)            /*!< 6.5    cycle */
#define ADC_SMPR_SAMP_SEL_12            (0x0CU << ADC_SMPR_SAMP_Pos)            /*!< 7.5    cycle */

