wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_adc.h
#define ADC_SMPR_SAMP_2_5               (0x00U << ADC_SMPR_SAMP_Pos)            /*!< 2.5    cycle */
#define ADC_SMPR_SAMP_8_5               (0x01U << ADC_SMPR_SAMP_Pos)            /*!< 8.5    cycle */
#define ADC_SMPR_SAMP_14_5              (0x02U << ADC_SMPR_SAMP_Pos)            /*!< 14.5   cycle */
#define ADC_SMPR_SAMP_29_5              (0x03U << ADC_SMPR_SAMP_Pos)            /*!< 29.5   cycle */
#define ADC_SMPR_SAMP_42_5              (0x04U << ADC_SMPR_SAMP_Pos)            /*!< 42.5   cycle */
#define ADC_SMPR_SAMP_56_5              (0x05U << ADC_SMPR_SAMP_Pos)            /*!< 56.5   cycle */
#define ADC_SMPR_SAMP_72_5              (0x06U << ADC_SMPR_SAMP_Pos)            /*!< 72.5   cycle */
#define ADC_SMPR_SAMP_240_5             (0x07U << ADC_SMPR_SAMP_Pos)            /*!< 240.5  cycle */
#define ADC_SMPR_SAMP_3_5               (0x08U << ADC_SMPR_SAMP_Pos)            /*!< 3.5    cycle */
#define ADC_SMPR_SAMP_4_5               (0x09U << ADC_SMPR_SAMP_Pos)            /*!< 4.5    cycle */
#define ADC_SMPR_SAMP_5_5               (0x0AU << ADC_SMPR_SAMP_Pos)            /*!< 5.5    cycle */
#define ADC_SMPR_SAMP_6_5               (0x0BU << ADC_SMPR_SAMP_Pos)            /*!< 6.5    cycle */
#define ADC_SMPR_SAMP_7_5               (0x0CU << ADC_SMPR_SAMP_Pos)            /*!< 7.5    cycle */

#define ADC_SMPR_SAMP_Pos_ShiftStep     (4)

#define ADC_SMPR1_SAMP0_Pos             (0)                                     /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR1_SAMP0_Msk             (0x0FU << ADC_SMPR1_SAMP0_Pos)          /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR1_SAMP0_2_5             (0x00U << ADC_SMPR1_SAMP0_Pos)          /*!< 2.5    cycle */
#define ADC_SMPR1_SAMP0_8_5             (0x01U << ADC_SMPR1_SAMP0_Pos)          /*!< 8.5    cycle */
#define ADC_SMPR1_SAMP0_14_5            (0x02U << ADC_SMPR1_SAMP0_Pos)          /*!< 14.5   cycle */
#define ADC_SMPR1_SAMP0_29_5            (0x03U << ADC_SMPR1_SAMP0_Pos)          /*!< 29.5   cycle */
#define ADC_SMPR1_SAMP0_42_5            (0x04U << ADC_SMPR1_SAMP0_Pos)          /*!< 42.5   cycle */
#define ADC_SMPR1_SAMP0_56_5            (0x05U << ADC_SMPR1_SAMP0_Pos)          /*!< 56.5   cycle */
#define ADC_SMPR1_SAMP0_72_5            (0x06U << ADC_SMPR1_SAMP0_Pos)          /*!< 72.5   cycle */
#define ADC_SMPR1_SAMP0_240_5           (0x07U << ADC_SMPR1_SAMP0_Pos)          /*!< 240.5  cycle */
#define ADC_SMPR1_SAMP0_3_5             (0x08U << ADC_SMPR1_SAMP0_Pos)          /*!< 3.5    cycle */
#define ADC_SMPR1_SAMP0_4_5             (0x09U << ADC_SMPR1_SAMP0_Pos)          /*!< 4.5    cycle */
#define ADC_SMPR1_SAMP0_5_5             (0x0AU << ADC_SMPR1_SAMP0_Pos)          /*!< 5.5    cycle */
#define ADC_SMPR1_SAMP0_6_5             (0x0BU << ADC_SMPR1_SAMP0_Pos)          /*!< 6.5    cycle */
#define ADC_SMPR1_SAMP0_7_5             (0x0CU << ADC_SMPR1_SAMP0_Pos)          /*!< 7.5    cycle */
#define ADC_SMPR1_SAMP1_Pos             (4)                                     /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR1_SAMP1_Msk             (0x0FU << ADC_SMPR1_SAMP1_Pos)          /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR1_SAMP1_2_5             (0x00U << ADC_SMPR1_SAMP1_Pos)          /*!< 2.5    cycle */
#define ADC_SMPR1_SAMP1_8_5             (0x01U << ADC_SMPR1_SAMP1_Pos)          /*!< 8.5    cycle */
#define ADC_SMPR1_SAMP1_14_5            (0x02U << ADC_SMPR1_SAMP1_Pos)          /*!< 14.5   cycle */
#define ADC_SMPR1_SAMP1_29_5            (0x03U << ADC_SMPR1_SAMP1_Pos)          /*!< 29.5   cycle */
#define ADC_SMPR1_SAMP1_42_5            (0x04U << ADC_SMPR1_SAMP1_Pos)          /*!< 42.5   cycle */
#define ADC_SMPR1_SAMP1_56_5            (0x05U << ADC_SMPR1_SAMP1_Pos)          /*!< 56.5   cycle */
#define ADC_SMPR1_SAMP1_72_5            (0x06U << ADC_SMPR1_SAMP1_Pos)          /*!< 72.5   cycle */
#define ADC_SMPR1_SAMP1_240_5           (0x07U << ADC_SMPR1_SAMP1_Pos)          /*!< 240.5  cycle */
#define ADC_SMPR1_SAMP1_3_5             (0x08U << ADC_SMPR1_SAMP1_Pos)          /*!< 3.5    cycle */
#define ADC_SMPR1_SAMP1_4_5             (0x09U << ADC_SMPR1_SAMP1_Pos)          /*!< 4.5    cycle */
#define ADC_SMPR1_SAMP1_5_5             (0x0AU << ADC_SMPR1_SAMP1_Pos)          /*!< 5.5    cycle */
#define ADC_SMPR1_SAMP1_6_5             (0x0BU << ADC_SMPR1_SAMP1_Pos)          /*!< 6.5    cycle */
#define ADC_SMPR1_SAMP1_7_5             (0x0CU << ADC_SMPR1_SAMP1_Pos)          /*!< 7.5    cycle */
#define ADC_SMPR1_SAMP2_Pos             (8)                                     /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR1_SAMP2_Msk             (0x0FU << ADC_SMPR1_SAMP2_Pos)          /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR1_SAMP2_2_5             (0x00U << ADC_SMPR1_SAMP2_Pos)          /*!< 2.5    cycle */
#define ADC_SMPR1_SAMP2_8_5             (0x01U << ADC_SMPR1_SAMP2_Pos)          /*!< 8.5    cycle */
#define ADC_SMPR1_SAMP2_14_5            (0x02U << ADC_SMPR1_SAMP2_Pos)          /*!< 14.5   cycle */
#define ADC_SMPR1_SAMP2_29_5            (0x03U << ADC_SMPR1_SAMP2_Pos)          /*!< 29.5   cycle */
#define ADC_SMPR1_SAMP2_42_5            (0x04U << ADC_SMPR1_SAMP2_Pos)          /*!< 42.5   cycle */
#define ADC_SMPR1_SAMP2_56_5            (0x05U << ADC_SMPR1_SAMP2_Pos)          /*!< 56.5   cycle */
#define ADC_SMPR1_SAMP2_72_5            (0x06U << ADC_SMPR1_SAMP2_Pos)          /*!< 72.5   cycle */
#define ADC_SMPR1_SAMP2_240_5           (0x07U << ADC_SMPR1_SAMP2_Pos)          /*!< 240.5  cycle */
#define ADC_SMPR1_SAMP2_3_5             (0x08U << ADC_SMPR1_SAMP2_Pos)          /*!< 3.5    cycle */
#define ADC_SMPR1_SAMP2_4_5             (0x09U << ADC_SMPR1_SAMP2_Pos)          /*!< 4.5    cycle */
#define ADC_SMPR1_SAMP2_5_5             (0x0AU << ADC_SMPR1_SAMP2_Pos)          /*!< 5.5    cycle */
#define ADC_SMPR1_SAMP2_6_5             (0x0BU << ADC_SMPR1_SAMP2_Pos)          /*!< 6.5    cycle */
#define ADC_SMPR1_SAMP2_7_5             (0x0CU << ADC_SMPR1_SAMP2_Pos)          /*!< 7.5    cycle */
#define ADC_SMPR1_SAMP3_Pos             (12)                                    /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR1_SAMP3_Msk             (0x0FU << ADC_SMPR1_SAMP3_Pos)          /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR1_SAMP3_2_5             (0x00U << ADC_SMPR1_SAMP3_Pos)          /*!< 2.5    cycle */
#define ADC_SMPR1_SAMP3_8_5             (0x01U << ADC_SMPR1_SAMP3_Pos)          /*!< 8.5    cycle */
#define ADC_SMPR1_SAMP3_14_5            (0x02U << ADC_SMPR1_SAMP3_Pos)          /*!< 14.5   cycle */
#define ADC_SMPR1_SAMP3_29_5            (0x03U << ADC_SMPR1_SAMP3_Pos)          /*!< 29.5   cycle */
#define ADC_SMPR1_SAMP3_42_5            (0x04U << ADC_SMPR1_SAMP3_Pos)          /*!< 42.5   cycle */
#define ADC_SMPR1_SAMP3_56_5            (0x05U << ADC_SMPR1_SAMP3_Pos)          /*!< 56.5   cycle */
#define ADC_SMPR1_SAMP3_72_5            (0x06U << ADC_SMPR1_SAMP3_Pos)          /*!< 72.5   cycle */
#define ADC_SMPR1_SAMP3_240_5           (0x07U << ADC_SMPR1_SAMP3_Pos)          /*!< 240.5  cycle */
#define ADC_SMPR1_SAMP3_3_5             (0x08U << ADC_SMPR1_SAMP3_Pos)          /*!< 3.5    cycle */
#define ADC_SMPR1_SAMP3_4_5             (0x09U << ADC_SMPR1_SAMP3_Pos)          /*!< 4.5    cycle */
#define ADC_SMPR1_SAMP3_5_5             (0x0AU << ADC_SMPR1_SAMP3_Pos)          /*!< 5.5    cycle */
#define ADC_SMPR1_SAMP3_6_5             (0x0BU << ADC_SMPR1_SAMP3_Pos)          /*!< 6.5    cycle */
#define ADC_SMPR1_SAMP3_7_5             (0x0CU << ADC_SMPR1_SAMP3_Pos)          /*!< 7.5    cycle */
#define ADC_SMPR1_SAMP4_Pos             (16)                                    /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR1_SAMP4_Msk             (0x0FU << ADC_SMPR1_SAMP4_Pos)          /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR1_SAMP4_2_5             (0x00U << ADC_SMPR1_SAMP4_Pos)          /*!< 2.5    cycle */
#define ADC_SMPR1_SAMP4_8_5             (0x01U << ADC_SMPR1_SAMP4_Pos)          /*!< 8.5    cycle */
#define ADC_SMPR1_SAMP4_14_5            (0x02U << ADC_SMPR1_SAMP4_Pos)          /*!< 14.5   cycle */
#define ADC_SMPR1_SAMP4_29_5            (0x03U << ADC_SMPR1_SAMP4_Pos)          /*!< 29.5   cycle */
#define ADC_SMPR1_SAMP4_42_5            (0x04U << ADC_SMPR1_SAMP4_Pos)          /*!< 42.5   cycle */
#define ADC_SMPR1_SAMP4_56_5            (0x05U << ADC_SMPR1_SAMP4_Pos)          /*!< 56.5   cycle */
#define ADC_SMPR1_SAMP4_72_5            (0x06U << ADC_SMPR1_SAMP4_Pos)          /*!< 72.5   cycle */
#define ADC_SMPR1_SAMP4_240_5           (0x07U << ADC_SMPR1_SAMP4_Pos)          /*!< 240.5  cycle */
#define ADC_SMPR1_SAMP4_3_5             (0x08U << ADC_SMPR1_SAMP4_Pos)          /*!< 3.5    cycle */
#define ADC_SMPR1_SAMP4_4_5             (0x09U << ADC_SMPR1_SAMP4_Pos)          /*!< 4.5    cycle */
#define ADC_SMPR1_SAMP4_5_5             (0x0AU << ADC_SMPR1_SAMP4_Pos)          /*!< 5.5    cycle */
#define ADC_SMPR1_SAMP4_6_5             (0x0BU << ADC_SMPR1_SAMP4_Pos)          /*!< 6.5    cycle */
#define ADC_SMPR1_SAMP4_7_5             (0x0CU << ADC_SMPR1_SAMP4_Pos)          /*!< 7.5    cycle */
#define ADC_SMPR1_SAMP5_Pos             (20)                                    /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR1_SAMP5_Msk             (0x0FU << ADC_SMPR1_SAMP5_Pos)          /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR1_SAMP5_2_5             (0x00U << ADC_SMPR1_SAMP5_Pos)          /*!< 2.5    cycle */
#define ADC_SMPR1_SAMP5_8_5             (0x01U << ADC_SMPR1_SAMP5_Pos)          /*!< 8.5    cycle */
#define ADC_SMPR1_SAMP5_14_5            (0x02U << ADC_SMPR1_SAMP5_Pos)          /*!< 14.5   cycle */
#define ADC_SMPR1_SAMP5_29_5            (0x03U << ADC_SMPR1_SAMP5_Pos)          /*!< 29.5   cycle */
#define ADC_SMPR1_SAMP5_42_5            (0x04U << ADC_SMPR1_SAMP5_Pos)          /*!< 42.5   cycle */
#define ADC_SMPR1_SAMP5_56_5            (0x05U << ADC_SMPR1_SAMP5_Pos)          /*!< 56.5   cycle */
#define ADC_SMPR1_SAMP5_72_5            (0x06U << ADC_SMPR1_SAMP5_Pos)          /*!< 72.5   cycle */
#define ADC_SMPR1_SAMP5_240_5           (0x07U << ADC_SMPR1_SAMP5_Pos)          /*!< 240.5  cycle */
#define ADC_SMPR1_SAMP5_3_5             (0x08U << ADC_SMPR1_SAMP5_Pos)          /*!< 3.5    cycle */
#define ADC_SMPR1_SAMP5_4_5             (0x09U << ADC_SMPR1_SAMP5_Pos)          /*!< 4.5    cycle */
#define ADC_SMPR1_SAMP5_5_5             (0x0AU << ADC_SMPR1_SAMP5_Pos)          /*!< 5.5    cycle */
#define ADC_SMPR1_SAMP5_6_5             (0x0BU << ADC_SMPR1_SAMP5_Pos)          /*!< 6.5    cycle */
#define ADC_SMPR1_SAMP5_7_5             (0x0CU << ADC_SMPR1_SAMP5_Pos)          /*!< 7.5    cycle */
#define ADC_SMPR1_SAMP6_Pos             (24)                                    /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR1_SAMP6_Msk             (0x0FU << ADC_SMPR1_SAMP6_Pos)          /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR1_SAMP6_2_5             (0x00U << ADC_SMPR1_SAMP6_Pos)          /*!< 2.5    cycle */
#define ADC_SMPR1_SAMP6_8_5             (0x01U << ADC_SMPR1_SAMP6_Pos)          /*!< 8.5    cycle */
#define ADC_SMPR1_SAMP6_14_5            (0x02U << ADC_SMPR1_SAMP6_Pos)          /*!< 14.5   cycle */
#define ADC_SMPR1_SAMP6_29_5            (0x03U << ADC_SMPR1_SAMP6_Pos)          /*!< 29.5   cycle */
#define ADC_SMPR1_SAMP6_42_5            (0x04U << ADC_SMPR1_SAMP6_Pos)          /*!< 42.5   cycle */
#define ADC_SMPR1_SAMP6_56_5            (0x05U << ADC_SMPR1_SAMP6_Pos)          /*!< 56.5   cycle */
#define ADC_SMPR1_SAMP6_72_5            (0x06U << ADC_SMPR1_SAMP6_Pos)          /*!< 72.5   cycle */
#define ADC_SMPR1_SAMP6_240_5           (0x07U << ADC_SMPR1_SAMP6_Pos)          /*!< 240.5  cycle */
#define ADC_SMPR1_SAMP6_3_5             (0x08U << ADC_SMPR1_SAMP6_Pos)          /*!< 3.5    cycle */
#define ADC_SMPR1_SAMP6_4_5             (0x09U << ADC_SMPR1_SAMP6_Pos)          /*!< 4.5    cycle */
#define ADC_SMPR1_SAMP6_5_5             (0x0AU << ADC_SMPR1_SAMP6_Pos)          /*!< 5.5    cycle */
#define ADC_SMPR1_SAMP6_6_5             (0x0BU << ADC_SMPR1_SAMP6_Pos)          /*!< 6.5    cycle */
#define ADC_SMPR1_SAMP6_7_5             (0x0CU << ADC_SMPR1_SAMP6_Pos)          /*!< 7.5    cycle */
#define ADC_SMPR1_SAMP7_Pos             (28)                                    /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR1_SAMP7_Msk             (0x0FU << ADC_SMPR1_SAMP7_Pos)          /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR1_SAMP7_2_5             (0x00U << ADC_SMPR1_SAMP7_Pos)          /*!< 2.5    cycle */
#define ADC_SMPR1_SAMP7_8_5             (0x01U << ADC_SMPR1_SAMP7_Pos)          /*!< 8.5    cycle */
#define ADC_SMPR1_SAMP7_14_5            (0x02U << ADC_SMPR1_SAMP7_Pos)          /*!< 14.5   cycle */
#define ADC_SMPR1_SAMP7_29_5            (0x03U << ADC_SMPR1_SAMP7_Pos)          /*!< 29.5   cycle */
#define ADC_SMPR1_SAMP7_42_5            (0x04U << ADC_SMPR1_SAMP7_Pos)          /*!< 42.5   cycle */
#define ADC_SMPR1_SAMP7_56_5            (0x05U << ADC_SMPR1_SAMP7_Pos)          /*!< 56.5   cycle */
#define ADC_SMPR1_SAMP7_72_5            (0x06U << ADC_SMPR1_SAMP7_Pos)          /*!< 72.5   cycle */
#define ADC_SMPR1_SAMP7_240_5           (0x07U << ADC_SMPR1_SAMP7_Pos)          /*!< 240.5  cycle */
#define ADC_SMPR1_SAMP7_3_5             (0x08U << ADC_SMPR1_SAMP7_Pos)          /*!< 3.5    cycle */
#define ADC_SMPR1_SAMP7_4_5             (0x09U << ADC_SMPR1_SAMP7_Pos)          /*!< 4.5    cycle */
#define ADC_SMPR1_SAMP7_5_5             (0x0AU << ADC_SMPR1_SAMP7_Pos)          /*!< 5.5    cycle */
#define ADC_SMPR1_SAMP7_6_5             (0x0BU << ADC_SMPR1_SAMP7_Pos)          /*!< 6.5    cycle */
#define ADC_SMPR1_SAMP7_7_5             (0x0CU << ADC_SMPR1_SAMP7_Pos)          /*!< 7.5    cycle */

