wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_adc.h
/**
  * @brief ADC_SMPR2 mode enable Register Bit Definition
  */
#define ADC_SMPR2_SAMP8_Pos             (0)                                     /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR2_SAMP8_Msk             (0x0FU << ADC_SMPR2_SAMP8_Pos)          /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR2_SAMP8_2_5             (0x00U << ADC_SMPR2_SAMP8_Pos)          /*!< 2.5    cycle */
#define ADC_SMPR2_SAMP8_8_5             (0x01U << ADC_SMPR2_SAMP8_Pos)          /*!< 8.5    cycle */
#define ADC_SMPR2_SAMP8_14_5            (0x02U << ADC_SMPR2_SAMP8_Pos)          /*!< 14.5   cycle */
#define ADC_SMPR2_SAMP8_29_5            (0x03U << ADC_SMPR2_SAMP8_Pos)          /*!< 29.5   cycle */
#define ADC_SMPR2_SAMP8_42_5            (0x04U << ADC_SMPR2_SAMP8_Pos)          /*!< 42.5   cycle */
#define ADC_SMPR2_SAMP8_56_5            (0x05U << ADC_SMPR2_SAMP8_Pos)          /*!< 56.5   cycle */
#define ADC_SMPR2_SAMP8_72_5            (0x06U << ADC_SMPR2_SAMP8_Pos)          /*!< 72.5   cycle */
#define ADC_SMPR2_SAMP8_240_5           (0x07U << ADC_SMPR2_SAMP8_Pos)          /*!< 240.5  cycle */
#define ADC_SMPR2_SAMP8_3_5             (0x08U << ADC_SMPR2_SAMP8_Pos)          /*!< 3.5    cycle */
#define ADC_SMPR2_SAMP8_4_5             (0x09U << ADC_SMPR2_SAMP8_Pos)          /*!< 4.5    cycle */
#define ADC_SMPR2_SAMP8_5_5             (0x0AU << ADC_SMPR2_SAMP8_Pos)          /*!< 5.5    cycle */
#define ADC_SMPR2_SAMP8_6_5             (0x0BU << ADC_SMPR2_SAMP8_Pos)          /*!< 6.5    cycle */
#define ADC_SMPR2_SAMP8_7_5             (0x0CU << ADC_SMPR2_SAMP8_Pos)          /*!< 7.5    cycle */
#define ADC_SMPR2_SAMP9_Pos             (4)                                     /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR2_SAMP9_Msk             (0x0FU << ADC_SMPR2_SAMP9_Pos)          /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR2_SAMP9_2_5             (0x00U << ADC_SMPR2_SAMP9_Pos)          /*!< 2.5    cycle */
#define ADC_SMPR2_SAMP9_8_5             (0x01U << ADC_SMPR2_SAMP9_Pos)          /*!< 8.5    cycle */
#define ADC_SMPR2_SAMP9_14_5            (0x02U << ADC_SMPR2_SAMP9_Pos)          /*!< 14.5   cycle */
#define ADC_SMPR2_SAMP9_29_5            (0x03U << ADC_SMPR2_SAMP9_Pos)          /*!< 29.5   cycle */
#define ADC_SMPR2_SAMP9_42_5            (0x04U << ADC_SMPR2_SAMP9_Pos)          /*!< 42.5   cycle */
#define ADC_SMPR2_SAMP9_56_5            (0x05U << ADC_SMPR2_SAMP9_Pos)          /*!< 56.5   cycle */
#define ADC_SMPR2_SAMP9_72_5            (0x06U << ADC_SMPR2_SAMP9_Pos)          /*!< 72.5   cycle */
#define ADC_SMPR2_SAMP9_240_5           (0x07U << ADC_SMPR2_SAMP9_Pos)          /*!< 240.5  cycle */
#define ADC_SMPR2_SAMP9_3_5             (0x08U << ADC_SMPR2_SAMP9_Pos)          /*!< 3.5    cycle */
#define ADC_SMPR2_SAMP9_4_5             (0x09U << ADC_SMPR2_SAMP9_Pos)          /*!< 4.5    cycle */
#define ADC_SMPR2_SAMP9_5_5             (0x0AU << ADC_SMPR2_SAMP9_Pos)          /*!< 5.5    cycle */
#define ADC_SMPR2_SAMP9_6_5             (0x0BU << ADC_SMPR2_SAMP9_Pos)          /*!< 6.5    cycle */
#define ADC_SMPR2_SAMP9_7_5             (0x0CU << ADC_SMPR2_SAMP9_Pos)          /*!< 7.5    cycle */
#define ADC_SMPR2_SAMP10_Pos            (8)                                     /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR2_SAMP10_Msk            (0x0FU << ADC_SMPR2_SAMP10_Pos)         /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR2_SAMP10_2_5            (0x00U << ADC_SMPR2_SAMP10_Pos)         /*!< 2.5    cycle */
#define ADC_SMPR2_SAMP10_8_5            (0x01U << ADC_SMPR2_SAMP10_Pos)         /*!< 8.5    cycle */
#define ADC_SMPR2_SAMP10_14_5           (0x02U << ADC_SMPR2_SAMP10_Pos)         /*!< 14.5   cycle */
#define ADC_SMPR2_SAMP10_29_5           (0x03U << ADC_SMPR2_SAMP10_Pos)         /*!< 29.5   cycle */
#define ADC_SMPR2_SAMP10_42_5           (0x04U << ADC_SMPR2_SAMP10_Pos)         /*!< 42.5   cycle */
#define ADC_SMPR2_SAMP10_56_5           (0x05U << ADC_SMPR2_SAMP10_Pos)         /*!< 56.5   cycle */
#define ADC_SMPR2_SAMP10_72_5           (0x06U << ADC_SMPR2_SAMP10_Pos)         /*!< 72.5   cycle */
#define ADC_SMPR2_SAMP10_240_5          (0x07U << ADC_SMPR2_SAMP10_Pos)         /*!< 240.5  cycle */
#define ADC_SMPR2_SAMP10_3_5            (0x08U << ADC_SMPR2_SAMP10_Pos)         /*!< 3.5    cycle */
#define ADC_SMPR2_SAMP10_4_5            (0x09U << ADC_SMPR2_SAMP10_Pos)         /*!< 4.5    cycle */
#define ADC_SMPR2_SAMP10_5_5            (0x0AU << ADC_SMPR2_SAMP10_Pos)         /*!< 5.5    cycle */
#define ADC_SMPR2_SAMP10_6_5            (0x0BU << ADC_SMPR2_SAMP10_Pos)         /*!< 6.5    cycle */
#define ADC_SMPR2_SAMP10_7_5            (0x0CU << ADC_SMPR2_SAMP10_Pos)         /*!< 7.5    cycle */
#define ADC_SMPR2_SAMP11_Pos            (12)                                    /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR2_SAMP11_Msk            (0x0FU << ADC_SMPR2_SAMP11_Pos)         /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR2_SAMP11_2_5            (0x00U << ADC_SMPR2_SAMP11_Pos)         /*!< 2.5    cycle */
#define ADC_SMPR2_SAMP11_8_5            (0x01U << ADC_SMPR2_SAMP11_Pos)         /*!< 8.5    cycle */
#define ADC_SMPR2_SAMP11_14_5           (0x02U << ADC_SMPR2_SAMP11_Pos)         /*!< 14.5   cycle */
#define ADC_SMPR2_SAMP11_29_5           (0x03U << ADC_SMPR2_SAMP11_Pos)         /*!< 29.5   cycle */
#define ADC_SMPR2_SAMP11_42_5           (0x04U << ADC_SMPR2_SAMP11_Pos)         /*!< 42.5   cycle */
#define ADC_SMPR2_SAMP11_56_5           (0x05U << ADC_SMPR2_SAMP11_Pos)         /*!< 56.5   cycle */
#define ADC_SMPR2_SAMP11_72_5           (0x06U << ADC_SMPR2_SAMP11_Pos)         /*!< 72.5   cycle */
#define ADC_SMPR2_SAMP11_240_5          (0x07U << ADC_SMPR2_SAMP11_Pos)         /*!< 240.5  cycle */
#define ADC_SMPR2_SAMP11_3_5            (0x08U << ADC_SMPR2_SAMP11_Pos)         /*!< 3.5    cycle */
#define ADC_SMPR2_SAMP11_4_5            (0x09U << ADC_SMPR2_SAMP11_Pos)         /*!< 4.5    cycle */
#define ADC_SMPR2_SAMP11_5_5            (0x0AU << ADC_SMPR2_SAMP11_Pos)         /*!< 5.5    cycle */
#define ADC_SMPR2_SAMP11_6_5            (0x0BU << ADC_SMPR2_SAMP11_Pos)         /*!< 6.5    cycle */
#define ADC_SMPR2_SAMP11_7_5            (0x0CU << ADC_SMPR2_SAMP11_Pos)         /*!< 7.5    cycle */
#define ADC_SMPR2_SAMP12_Pos            (16)                                    /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR2_SAMP12_Msk            (0x0FU << ADC_SMPR2_SAMP12_Pos)         /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR2_SAMP12_2_5            (0x00U << ADC_SMPR2_SAMP12_Pos)         /*!< 2.5    cycle */
#define ADC_SMPR2_SAMP12_8_5            (0x01U << ADC_SMPR2_SAMP12_Pos)         /*!< 8.5    cycle */
#define ADC_SMPR2_SAMP12_14_5           (0x02U << ADC_SMPR2_SAMP12_Pos)         /*!< 14.5   cycle */
#define ADC_SMPR2_SAMP12_29_5           (0x03U << ADC_SMPR2_SAMP12_Pos)         /*!< 29.5   cycle */
#define ADC_SMPR2_SAMP12_42_5           (0x04U << ADC_SMPR2_SAMP12_Pos)         /*!< 42.5   cycle */
#define ADC_SMPR2_SAMP12_56_5           (0x05U << ADC_SMPR2_SAMP12_Pos)         /*!< 56.5   cycle */
#define ADC_SMPR2_SAMP12_72_5           (0x06U << ADC_SMPR2_SAMP12_Pos)         /*!< 72.5   cycle */
#define ADC_SMPR2_SAMP12_240_5          (0x07U << ADC_SMPR2_SAMP12_Pos)         /*!< 240.5  cycle */
#define ADC_SMPR2_SAMP12_3_5            (0x08U << ADC_SMPR2_SAMP12_Pos)         /*!< 3.5    cycle */
#define ADC_SMPR2_SAMP12_4_5            (0x09U << ADC_SMPR2_SAMP12_Pos)         /*!< 4.5    cycle */
#define ADC_SMPR2_SAMP12_5_5            (0x0AU << ADC_SMPR2_SAMP12_Pos)         /*!< 5.5    cycle */
#define ADC_SMPR2_SAMP12_6_5            (0x0BU << ADC_SMPR2_SAMP12_Pos)         /*!< 6.5    cycle */
#define ADC_SMPR2_SAMP12_7_5            (0x0CU << ADC_SMPR2_SAMP12_Pos)         /*!< 7.5    cycle */
#define ADC_SMPR2_SAMP13_Pos            (20)                                    /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR2_SAMP13_Msk            (0x0FU << ADC_SMPR2_SAMP13_Pos)         /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR2_SAMP13_2_5            (0x00U << ADC_SMPR2_SAMP13_Pos)         /*!< 2.5    cycle */
#define ADC_SMPR2_SAMP13_8_5            (0x01U << ADC_SMPR2_SAMP13_Pos)         /*!< 8.5    cycle */
#define ADC_SMPR2_SAMP13_14_5           (0x02U << ADC_SMPR2_SAMP13_Pos)         /*!< 14.5   cycle */
#define ADC_SMPR2_SAMP13_29_5           (0x03U << ADC_SMPR2_SAMP13_Pos)         /*!< 29.5   cycle */
#define ADC_SMPR2_SAMP13_42_5           (0x04U << ADC_SMPR2_SAMP13_Pos)         /*!< 42.5   cycle */
#define ADC_SMPR2_SAMP13_56_5           (0x05U << ADC_SMPR2_SAMP13_Pos)         /*!< 56.5   cycle */
#define ADC_SMPR2_SAMP13_72_5           (0x06U << ADC_SMPR2_SAMP13_Pos)         /*!< 72.5   cycle */
#define ADC_SMPR2_SAMP13_240_5          (0x07U << ADC_SMPR2_SAMP13_Pos)         /*!< 240.5  cycle */
#define ADC_SMPR2_SAMP13_3_5            (0x08U << ADC_SMPR2_SAMP13_Pos)         /*!< 3.5    cycle */
#define ADC_SMPR2_SAMP13_4_5            (0x09U << ADC_SMPR2_SAMP13_Pos)         /*!< 4.5    cycle */
#define ADC_SMPR2_SAMP13_5_5            (0x0AU << ADC_SMPR2_SAMP13_Pos)         /*!< 5.5    cycle */
#define ADC_SMPR2_SAMP13_6_5            (0x0BU << ADC_SMPR2_SAMP13_Pos)         /*!< 6.5    cycle */
#define ADC_SMPR2_SAMP13_7_5            (0x0CU << ADC_SMPR2_SAMP13_Pos)         /*!< 7.5    cycle */
#define ADC_SMPR2_SAMP14_Pos            (24)                                    /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR2_SAMP14_Msk            (0x0FU << ADC_SMPR2_SAMP14_Pos)         /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR2_SAMP14_2_5            (0x00U << ADC_SMPR2_SAMP14_Pos)         /*!< 2.5    cycle */
#define ADC_SMPR2_SAMP14_8_5            (0x01U << ADC_SMPR2_SAMP14_Pos)         /*!< 8.5    cycle */
#define ADC_SMPR2_SAMP14_14_5           (0x02U << ADC_SMPR2_SAMP14_Pos)         /*!< 14.5   cycle */
#define ADC_SMPR2_SAMP14_29_5           (0x03U << ADC_SMPR2_SAMP14_Pos)         /*!< 29.5   cycle */
#define ADC_SMPR2_SAMP14_42_5           (0x04U << ADC_SMPR2_SAMP14_Pos)         /*!< 42.5   cycle */
#define ADC_SMPR2_SAMP14_56_5           (0x05U << ADC_SMPR2_SAMP14_Pos)         /*!< 56.5   cycle */
#define ADC_SMPR2_SAMP14_72_5           (0x06U << ADC_SMPR2_SAMP14_Pos)         /*!< 72.5   cycle */
#define ADC_SMPR2_SAMP14_240_5          (0x07U << ADC_SMPR2_SAMP14_Pos)         /*!< 240.5  cycle */
#define ADC_SMPR2_SAMP14_3_5            (0x08U << ADC_SMPR2_SAMP14_Pos)         /*!< 3.5    cycle */
#define ADC_SMPR2_SAMP14_4_5            (0x09U << ADC_SMPR2_SAMP14_Pos)         /*!< 4.5    cycle */
#define ADC_SMPR2_SAMP14_5_5            (0x0AU << ADC_SMPR2_SAMP14_Pos)         /*!< 5.5    cycle */
#define ADC_SMPR2_SAMP14_6_5            (0x0BU << ADC_SMPR2_SAMP14_Pos)         /*!< 6.5    cycle */
#define ADC_SMPR2_SAMP14_7_5            (0x0CU << ADC_SMPR2_SAMP14_Pos)         /*!< 7.5    cycle */
#define ADC_SMPR2_SAMP15_Pos            (28)                                    /*!< select the sample time of corresponding channel off_set Position */
#define ADC_SMPR2_SAMP15_Msk            (0x0FU << ADC_SMPR2_SAMP15_Pos)         /*!< select the sample time of corresponding channel mask for Value */
#define ADC_SMPR2_SAMP15_2_5            (0x00U << ADC_SMPR2_SAMP15_Pos)         /*!< 2.5    cycle */
#define ADC_SMPR2_SAMP15_8_5            (0x01U << ADC_SMPR2_SAMP15_Pos)         /*!< 8.5    cycle */
#define ADC_SMPR2_SAMP15_14_5           (0x02U << ADC_SMPR2_SAMP15_Pos)         /*!< 14.5   cycle */
#define ADC_SMPR2_SAMP15_29_5           (0x03U << ADC_SMPR2_SAMP15_Pos)         /*!< 29.5   cycle */
#define ADC_SMPR2_SAMP15_42_5           (0x04U << ADC_SMPR2_SAMP15_Pos)         /*!< 42.5   cycle */
#define ADC_SMPR2_SAMP15_56_5           (0x05U << ADC_SMPR2_SAMP15_Pos)         /*!< 56.5   cycle */
#define ADC_SMPR2_SAMP15_72_5           (0x06U << ADC_SMPR2_SAMP15_Pos)         /*!< 72.5   cycle */
#define ADC_SMPR2_SAMP15_240_5          (0x07U << ADC_SMPR2_SAMP15_Pos)         /*!< 240.5  cycle */
#define ADC_SMPR2_SAMP15_3_5            (0x08U << ADC_SMPR2_SAMP15_Pos)         /*!< 3.5    cycle */
#define ADC_SMPR2_SAMP15_4_5            (0x09U << ADC_SMPR2_SAMP15_Pos)         /*!< 4.5    cycle */
#define ADC_SMPR2_SAMP15_5_5            (0x0AU << ADC_SMPR2_SAMP15_Pos)         /*!< 5.5    cycle */
#define ADC_SMPR2_SAMP15_6_5            (0x0BU << ADC_SMPR2_SAMP15_Pos)         /*!< 6.5    cycle */
#define ADC_SMPR2_SAMP15_7_5            (0x0CU << ADC_SMPR2_SAMP15_Pos)         /*!< 7.5    cycle */

