wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_adc.h
/**
  * @brief ADC_JOFR0 mode enable Register Bit Definition
  */
#define ADC_JOFR0_JOFFSET               (0xFFFU)                                /*!< Compensates for the A/D conversion results of the injected channel 0 */
/**
  * @brief ADC_JOFR1 mode enable Register Bit Definition
  */
#define ADC_JOFR1_JOFFSET               (0xFFFU)                                /*!< Compensates for the A/D conversion results of the injected channel 1 */
/**
  * @brief ADC_JOFR2 mode enable Register Bit Definition
  */
#define ADC_JOFR2_JOFFSET               (0xFFFU)                                /*!< Compensates for the A/D conversion results of the injected channel 2 */
/**
  * @brief ADC_JOFR3 mode enable Register Bit Definition
  */
#define ADC_JOFR3_JOFFSET               (0xFFFU)                                /*!< Compensates for the A/D conversion results of the injected channel 3 */
/**
  * @brief ADC_JSQR mode enable Register Bit Definition
  */
#define ADC_JSQR_JSQ0_Pos               (0)                                     /*!< 1st conversion in injected sequence */
#define ADC_JSQR_JSQ0                   (0x1FU << ADC_JSQR_JSQ0_Pos)            /*!< 0th Conversion for Injected Sequence */
#define ADC_JSQR_JSQ0_CH0               (0x00U << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 0 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH1               (0x01U << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 1 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH2               (0x02U << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 2 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH3               (0x03U << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 3 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH4               (0x04U << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 4 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH5               (0x05U << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 5 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH6               (0x06U << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 6 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH7               (0x07U << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 7 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH8               (0x08U << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 8 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH9               (0x09U << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 9 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH10              (0x0AU << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 10 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH11              (0x0BU << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 11 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH12              (0x0CU << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 12 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH13              (0x0DU << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 13 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH14              (0x0EU << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 14 as injection channel 0 */
#define ADC_JSQR_JSQ0_CH15              (0x0FU << ADC_JSQR_JSQ0_Pos)            /*!< Configure any channel 15 as injection channel 0 */
#define ADC_JSQR_JSQ0_0                 (0x01U << ADC_JSQR_JSQ0_Pos)            /*!< Bit 0 */
#define ADC_JSQR_JSQ0_1                 (0x02U << ADC_JSQR_JSQ0_Pos)            /*!< Bit 1 */
#define ADC_JSQR_JSQ0_2                 (0x04U << ADC_JSQR_JSQ0_Pos)            /*!< Bit 2 */
#define ADC_JSQR_JSQ0_3                 (0x08U << ADC_JSQR_JSQ0_Pos)            /*!< Bit 3 */
#define ADC_JSQR_JSQ0_4                 (0x10U << ADC_JSQR_JSQ0_Pos)            /*!< Bit 4 */
#define ADC_JSQR_JSQ1_Pos               (5)                                     /*!< 2st conversion in injected sequence */
#define ADC_JSQR_JSQ1                   (0x1FU << ADC_JSQR_JSQ1_Pos)            /*!< 1th Conversion for Injected Sequence */
#define ADC_JSQR_JSQ1_CH0               (0x00U << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 0 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH1               (0x01U << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 1 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH2               (0x02U << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 2 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH3               (0x03U << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 3 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH4               (0x04U << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 4 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH5               (0x05U << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 5 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH6               (0x06U << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 6 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH7               (0x07U << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 7 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH8               (0x08U << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 8 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH9               (0x09U << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 9 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH10              (0x0AU << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 10 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH11              (0x0BU << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 11 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH12              (0x0CU << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 12 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH13              (0x0DU << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 13 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH14              (0x0EU << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 14 as injection channel 1 */
#define ADC_JSQR_JSQ1_CH15              (0x0FU << ADC_JSQR_JSQ1_Pos)            /*!< Configure any channel 15 as injection channel 1 */
#define ADC_JSQR_JSQ1_0                 (0x01U << ADC_JSQR_JSQ1_Pos)            /*!< Bit 0 */
#define ADC_JSQR_JSQ1_1                 (0x02U << ADC_JSQR_JSQ1_Pos)            /*!< Bit 1 */
#define ADC_JSQR_JSQ1_2                 (0x04U << ADC_JSQR_JSQ1_Pos)            /*!< Bit 2 */
#define ADC_JSQR_JSQ1_3                 (0x08U << ADC_JSQR_JSQ1_Pos)            /*!< Bit 3 */
#define ADC_JSQR_JSQ1_4                 (0x10U << ADC_JSQR_JSQ1_Pos)            /*!< Bit 4 */
#define ADC_JSQR_JSQ2_Pos               (10)                                    /*!< 3st conversion in injected sequence */
#define ADC_JSQR_JSQ2                   (0x1FU << ADC_JSQR_JSQ2_Pos)            /*!< 2th Conversion for Injected Sequence */
#define ADC_JSQR_JSQ2_CH0               (0x00U << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 0 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH1               (0x01U << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 1 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH2               (0x02U << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 2 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH3               (0x03U << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 3 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH4               (0x04U << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 4 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH5               (0x05U << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 5 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH6               (0x06U << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 6 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH7               (0x07U << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 7 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH8               (0x08U << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 8 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH9               (0x09U << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 9 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH10              (0x0AU << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 10 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH11              (0x0BU << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 11 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH12              (0x0CU << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 12 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH13              (0x0DU << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 13 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH14              (0x0EU << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 14 as injection channel 2 */
#define ADC_JSQR_JSQ2_CH15              (0x0FU << ADC_JSQR_JSQ2_Pos)            /*!< Configure any channel 15 as injection channel 2 */
#define ADC_JSQR_JSQ2_0                 (0x01U << ADC_JSQR_JSQ2_Pos)            /*!< Bit 0 */
#define ADC_JSQR_JSQ2_1                 (0x02U << ADC_JSQR_JSQ2_Pos)            /*!< Bit 1 */
#define ADC_JSQR_JSQ2_2                 (0x04U << ADC_JSQR_JSQ2_Pos)            /*!< Bit 2 */
#define ADC_JSQR_JSQ2_3                 (0x08U << ADC_JSQR_JSQ2_Pos)            /*!< Bit 3 */
#define ADC_JSQR_JSQ2_4                 (0x10U << ADC_JSQR_JSQ2_Pos)            /*!< Bit 4 */
#define ADC_JSQR_JSQ3_Pos               (15)                                    /*!< 4st conversion in injected sequence */
#define ADC_JSQR_JSQ3                   (0x1FU << ADC_JSQR_JSQ3_Pos)            /*!< 3th Conversion for Injected Sequence */
#define ADC_JSQR_JSQ3_CH0               (0x00U << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 0 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH1               (0x01U << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 1 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH2               (0x02U << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 2 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH3               (0x03U << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 3 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH4               (0x04U << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 4 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH5               (0x05U << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 5 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH6               (0x06U << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 6 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH7               (0x07U << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 7 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH8               (0x08U << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 8 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH9               (0x09U << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 9 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH10              (0x0AU << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 10 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH11              (0x0BU << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 11 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH12              (0x0CU << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 12 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH13              (0x0DU << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 13 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH14              (0x0EU << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 14 as injection channel 3 */
#define ADC_JSQR_JSQ3_CH15              (0x0FU << ADC_JSQR_JSQ3_Pos)            /*!< Configure any channel 15 as injection channel 3 */
#define ADC_JSQR_JSQ3_0                 (0x01U << ADC_JSQR_JSQ3_Pos)            /*!< Bit 0 */
#define ADC_JSQR_JSQ3_1                 (0x02U << ADC_JSQR_JSQ3_Pos)            /*!< Bit 1 */
#define ADC_JSQR_JSQ3_2                 (0x04U << ADC_JSQR_JSQ3_Pos)            /*!< Bit 2 */
#define ADC_JSQR_JSQ3_3                 (0x08U << ADC_JSQR_JSQ3_Pos)            /*!< Bit 3 */
#define ADC_JSQR_JSQ3_4                 (0x10U << ADC_JSQR_JSQ3_Pos)            /*!< Bit 4 */

#define ADC_JSQR_JNUM_Pos               (20)
#define ADC_JSQR_JNUM                   (0x03U << ADC_JSQR_JNUM_Pos)            /*!< Channel Number for Injected Sequence mask */
#define ADC_JSQR_JNUM_MODE0             (0x00U << ADC_JSQR_JNUM_Pos)            /*!< JSQ0 channel only */
#define ADC_JSQR_JNUM_MODE1             (0x01U << ADC_JSQR_JNUM_Pos)            /*!< JSQ0~JSQ1 channels */
#define ADC_JSQR_JNUM_MODE2             (0x02U << ADC_JSQR_JNUM_Pos)            /*!< JSQ0~JSQ2 channels */
#define ADC_JSQR_JNUM_MODE3             (0x03U << ADC_JSQR_JNUM_Pos)            /*!< JSQ0~JSQ3 channels */
#define ADC_JSQR_JNUM_0                 (0x01U << ADC_JSQR_JNUM_Pos)            /*!< Channel Number for Injected Sequence bit 0 */
#define ADC_JSQR_JNUM_1                 (0x02U << ADC_JSQR_JNUM_Pos)            /*!< Channel Number for Injected Sequence bit 1 */

/**
  * @brief ADC_JDATA mode enable Register Bit Definition
  */
#define ADC_JADDATA_JDATA_Pos           (0)
#define ADC_JADDATA_JDATA               (0xFFFFU << ADC_JADDATA_JDATA_Pos)      /*!< Transfer data */
#define ADC_JADDATA_JCHANNELSEL_Pos     (16)
#define ADC_JADDATA_JCHANNELSEL         (0x1FU << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Channel selection */
#define ADC_JADDATA_JCHANNELSEL_CHAN0   (0x00U << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 0 */
#define ADC_JADDATA_JCHANNELSEL_CHAN1   (0x01U << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 1 */
#define ADC_JADDATA_JCHANNELSEL_CHAN2   (0x02U << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 2 */
#define ADC_JADDATA_JCHANNELSEL_CHAN3   (0x03U << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 3 */
#define ADC_JADDATA_JCHANNELSEL_CHAN4   (0x04U << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 4 */
#define ADC_JADDATA_JCHANNELSEL_CHAN5   (0x05U << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 5 */
#define ADC_JADDATA_JCHANNELSEL_CHAN6   (0x06U << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 6 */
#define ADC_JADDATA_JCHANNELSEL_CHAN7   (0x07U << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 7 */
#define ADC_JADDATA_JCHANNELSEL_CHAN8   (0x08U << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 8 */
#define ADC_JADDATA_JCHANNELSEL_CHAN9   (0x09U << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 9 */
#define ADC_JADDATA_JCHANNELSEL_CHAN10  (0x0AU << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 10 */
#define ADC_JADDATA_JCHANNELSEL_CHAN11  (0x0BU << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 11 */
#define ADC_JADDATA_JCHANNELSEL_CHAN12  (0x0CU << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 12 */
#define ADC_JADDATA_JCHANNELSEL_CHAN13  (0x0DU << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 13 */
#define ADC_JADDATA_JCHANNELSEL_CHAN14  (0x0EU << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 14 */
#define ADC_JADDATA_JCHANNELSEL_CHAN15  (0x0FU << ADC_JADDATA_JCHANNELSEL_Pos)  /*!< Conversion data of channel 15 */

#define ADC_JADDATA_JOVERRUN_Pos        (21)
#define ADC_JADDATA_JOVERRUN            (0x01U << ADC_JADDATA_JOVERRUN_Pos)     /*!< Overrun flag */
#define ADC_JADDATA_JVALID_Pos          (22)
#define ADC_JADDATA_JVALID              (0x01U << ADC_JADDATA_JVALID_Pos)       /*!< Valid flag */

/**
  * @brief ADC_JDR0 mode enable Register Bit Definition
  */
#define ADC_JDR0_JDATA_Pos              (0)
#define ADC_JDR0_JDATA                  (0xFFFFU << ADC_JDR0_JDATA_Pos)         /*!< Transfer data */
#define ADC_JDR0_JOVERRUN_Pos           (21)
#define ADC_JDR0_JOVERRUN               (0x01U << ADC_JDR0_JOVERRUN_Pos)        /*!< Overrun flag */
#define ADC_JDR0_JVALID_Pos             (22)
#define ADC_JDR0_JVALID                 (0x01U << ADC_JDR0_JVALID_Pos)          /*!< Valid flag */

/**
  * @brief ADC_JDR1 mode enable Register Bit Definition
  */
#define ADC_JDR1_JDATA_Pos              (0)
#define ADC_JDR1_JDATA                  (0xFFFFU << ADC_JDR1_JDATA_Pos)         /*!< Transfer data */
#define ADC_JDR1_JOVERRUN_Pos           (21)
#define ADC_JDR1_JOVERRUN               (0x01U << ADC_JDR1_JOVERRUN_Pos)        /*!< Overrun flag */
#define ADC_JDR1_JVALID_Pos             (22)
#define ADC_JDR1_JVALID                 (0x01U << ADC_JDR1_JVALID_Pos)          /*!< Valid flag */

/**
  * @brief ADC_JDR2 mode enable Register Bit Definition
  */
#define ADC_JDR2_JDATA_Pos              (0)
#define ADC_JDR2_JDATA                  (0xFFFFU << ADC_JDR2_JDATA_Pos)         /*!< Transfer data */
#define ADC_JDR2_JOVERRUN_Pos           (21)
#define ADC_JDR2_JOVERRUN               (0x01U << ADC_JDR2_JOVERRUN_Pos)        /*!< Overrun flag */
#define ADC_JDR2_JVALID_Pos             (22)
#define ADC_JDR2_JVALID                 (0x01U << ADC_JDR2_JVALID_Pos)          /*!< Valid flag */

/**
  * @brief ADC_JDR3 mode enable Register Bit Definition
  */
#define ADC_JDR3_JDATA_Pos              (0)
#define ADC_JDR3_JDATA                  (0xFFFFU << ADC_JDR3_JDATA_Pos)         /*!< Transfer data */
#define ADC_JDR3_JOVERRUN_Pos           (21)
#define ADC_JDR3_JOVERRUN               (0x01U << ADC_JDR3_JOVERRUN_Pos)        /*!< Overrun flag */
#define ADC_JDR3_JVALID_Pos             (22)
#define ADC_JDR3_JVALID                 (0x01U << ADC_JDR3_JVALID_Pos)          /*!< Valid flag */

/**
  * @brief ADC_LDATA mode enable Register Bit Definition
  */
#define ADC_LDATA_LDATA_Pos             (0)
#define ADC_LDATA_LDATA                 (0xFFFFU << ADC_LDATA_LDATA_Pos)        /*!< Last Conversion Data */
#define ADC_LDATA_LCHANNELSEL_Pos       (16)
#define ADC_LDATA_LCHANNELSEL           (0x0FU << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Last Channel Selection: */
#define ADC_LDATA_LCHANNELSEL_CH0       (0x00U << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 1 */
#define ADC_LDATA_LCHANNELSEL_CH1       (0x01U << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 2 */
#define ADC_LDATA_LCHANNELSEL_CH2       (0x02U << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 3 */
#define ADC_LDATA_LCHANNELSEL_CH3       (0x03U << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 4 */
#define ADC_LDATA_LCHANNELSEL_CH4       (0x04U << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 5 */
#define ADC_LDATA_LCHANNELSEL_CH5       (0x05U << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 6 */
#define ADC_LDATA_LCHANNELSEL_CH6       (0x06U << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 7 */
#define ADC_LDATA_LCHANNELSEL_CH7       (0x07U << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 8 */
#define ADC_LDATA_LCHANNELSEL_CH8       (0x08U << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 9 */
#define ADC_LDATA_LCHANNELSEL_CH9       (0x09U << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 10 */
#define ADC_LDATA_LCHANNELSEL_CH10      (0x0AU << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 11 */
#define ADC_LDATA_LCHANNELSEL_CH11      (0x0BU << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 12 */
#define ADC_LDATA_LCHANNELSEL_CH12      (0x0CU << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 13 */
#define ADC_LDATA_LCHANNELSEL_CH13      (0x0DU << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 14 */
#define ADC_LDATA_LCHANNELSEL_CH14      (0x0EU << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 15 */
#define ADC_LDATA_LCHANNELSEL_CH15      (0x0FU << ADC_LDATA_LCHANNELSEL_Pos)    /*!< Channel 16 */
#define ADC_LDATA_LOVERRUN_Pos          (20)
#define ADC_LDATA_LOVERRUM              (0x01U << ADC_LDATA_LOVERRUN_Pos)       /*!< Overrun Flag */
#define ADC_LDATA_LVALID_Pos            (21)
#define ADC_LDATA_LVALID                (0x01U << ADC_LDATA_LVALID_Pos)         /*!< Valid Flag */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------*/
#endif
/*----------------------------------------------------------------------------*/
